{"transcript": [{"type": "line", "person": "Tim", "line": "I'm telling you, if you see one movie this year, it's gotta be this one. Sorry guys, I can't give great reviews to every movie I see. This one's only getting three bags of popcorn. I don't know what movies to see this week. Wel, we're here to help. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hey everybody. My name is Tim Heidecker. Welcome to another episode of On Cinema at the Cinema. It's a webseries where we talk about movies coming out this weekend and we also try to give you some advice as to whether or not you should go see these movies. Uhh, lot of fun stuff going on in our world in cinema-wise. Thank you so much for all the great comments and wonderful response we've gotten from the show. Just happy to help and um, we'll hopefully keep making more of these shows. Uh, my guest today is Gregg Turkington."}, {"type": "line", "person": "Gregg", "line": "<tck> Hey guys... Good to be here!"}, {"type": "line", "person": "Tim", "line": "... <sniffs> Alright, and"}, {"type": "line", "person": "Gregg", "line": "And uh-"}, {"type": "line", "person": "Tim", "line": "For the-"}, {"type": "line", "person": "Gregg", "line": "What are today's films?"}, {"type": "line", "person": "Tim", "line": "Uh, m- today's movie is c- uh, called The Fr- <deep breath>"}, {"type": "line", "person": "Gregg", "line": "Frozen ground."}, {"type": "line", "person": "Tim", "line": "Frozen Ground, with Nicholas Cage and directed by Scott Walker, and it's about a murderer seria- a serial killer movie."}, {"type": "line", "person": "Gregg", "line": "It's a serial killer movie with a twist at the end as I guess a lot of 'em do. Um, serial killers are not funny business, that's definitely a segment of society that should be eliminated. Uh, which they do at the end of this movie. It's uh, wouldn't call it a lot of fun, but it's definitely thought-provoking. Keeps you on the edge of your seat."}, {"type": "line", "person": "Tim", "line": "<sniffs> Uh..."}, {"type": "line", "person": "Gregg", "line": "And Nicholas Cage is great in it and John Cusack also, who we haven't seen a lot of in a long time, but it's good to see him back on the screen, and winning us all over 'cause he's always great."}, {"type": "line", "person": "Tim", "line": "<long pause, deep breath> And uh, Universal Soldier-"}, {"type": "line", "person": "Gregg", "line": "But uh, oh and I give and how many- uh, what did you think of The Frozen Ground?"}, {"type": "line", "person": "Tim", "line": "... <sniffs> four p- uh, bags of popcorn"}, {"type": "line", "person": "Gregg", "line": "<tck> I'm gonna agree with you. Four bags of popcorn seems appropriate. Probably no uh, treats to go along with that, 'cause it is a dark, somber film. And then..."}, {"type": "line", "person": "Tim", "line": "...Uh, Universal Soldier: Day of Reckoning, which is uh, another John Claude Gan- Van Dam movie with Lolph- Dolph Lundgring- Do- Jelph Lung- Jelph Lung- Uh... nother John Clau-fren dam movie with Lolpht- uh, Lung- uh,Lung- uh, Dolph Lundgren."}, {"type": "line", "person": "Gregg", "line": "Lundgren. Dolph Lundgren. Um... Alright. Um... Uh, Day of Reckoning is an action film, and there's a lot of action in it, um, everything from overturning cars to explosions to sh- old fashioned shoot 'em ups and uh, it's a- it's a thriller. It's probably not for the faint of heart. Probably... Uh, and if you've seen John Claude Van Dam, you know what to expect. Um, I thought it was a little bit better than- than the uh, than most of his films, but um, uh, I'm biased, I ow- I own them all. So Day of Reckoning, I would give that five- five tubs of popcorn with uh, maybe a can of Redbull. Keep ya going. Tim?"}, {"type": "line", "person": "Tim", "line": "<exhales, whimpers>"}, {"type": "line", "person": "Gregg", "line": "And how many bags of popcorn?"}, {"type": "line", "person": "Tim", "line": "<sobs>"}, {"type": "line", "person": "Gregg", "line": "I th- I would give 'em both fou- er, five."}, {"type": "line", "person": "Tim", "line": "<sobs>"}, {"type": "line", "person": "Gregg", "line": "<tck> and uh, so keep on watching. And enjoy the movies."}, {"type": "line", "person": "Tim", "line": "<sobs>"}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "<sobs>"}], "name": "S01E05"}