{"transcript": [{"type": "line", "person": "Tim", "line": "Ah man! This movie had it all. It had action, drama, comedy, suspense, and dance. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker, I'm the host of On Cinema at the Cinema. It's the only webisode show where we uh, tell you what's coming out in theaters this weekend, and also tell you what movies to check out, and also maybe what movies to s- uh, you could skip. Uh, my guest this week is a film buff, film historian, a guy that knows a lot about movies, is a lot of fun to talk to. His name is Gregg Turkington."}, {"type": "line", "person": "Gregg", "line": "<tck> Hey Tim, hey guys. It's great to be here, especially this week when we're covering a couple of uh, what I think are gonna be the-"}, {"type": "line", "person": "Tim", "line": "Lemme introduce- lemme introduce the movies."}, {"type": "line", "person": "Gregg", "line": "Okay."}, {"type": "line", "person": "Tim", "line": "The movies this week, I gotta say, we should have two episodes for this episode, because of how big the movies are. Um-"}, {"type": "line", "person": "Gregg", "line": "Well, we should."}, {"type": "line", "person": "Tim", "line": "Well, we won't."}, {"type": "line", "person": "Tim", "line": "Um, this one is just so big. It's called Hobbit. With an unexpected uh- The Unexpected Journey by- or, sorry, The Hobbit: An Unexpected Journey for 3D and IMAX. I mea- I tell ya, I am such a fan of these Lord of the Rings movies, and this one just keeps- keeps the energy of the old- the movies going, it's classic, and I thought, uh, that this was uh, just a terrific movie and uh, loved it, and uh-"}, {"type": "line", "person": "Gregg", "line": "I'll give you my one word review, and then we'll get in- dig into it a little bit deeper. My one word review is... Finally. Because I've been waiting for this film, when the Lord of the Rings series ended, uh, it was a blow. We felt like, well, this is sort of, uh, our era coming to a close and what, uh, what next?"}, {"type": "line", "person": "Tim", "line": "The end of the road."}, {"type": "line", "person": "Gregg", "line": "And I'm sort of a Hobbit freak, and so when I heard that they were gonna do this, I got very, very excited, started counting the days, X-ing out the days on the calendar until The Hobbit would finally be made reality, and it has, and I couldn't be happier with the results."}, {"type": "line", "person": "Tim", "line": "Yeah."}, {"type": "line", "person": "Gregg", "line": "This is fun, and I saw it on the big IMAX screen, but I would watch it again on the smallest screen available, I mean, any size, you're gonna love this film."}, {"type": "line", "person": "Tim", "line": "It's great. You got Peter Jackson's back at the helm, you got Morgan Freeman, Ian McKellan-"}, {"type": "line", "person": "Gregg", "line": "It's Ma- Martin Freeman."}, {"type": "line", "person": "Tim", "line": "Morga- uh, Martin Freeman, Egan McKellan, Mitch- or Richard Armiche- Richard Armich- Armitage... And uh-"}, {"type": "line", "person": "Gregg", "line": "And of course the big star, Bilbo Baggins, the Hobbit himself, and that's what really makes this movie rock 'n roll. He's sort of a personal hero of mine, and to see him fully realised like this, uh, it makes your heart skip a beat, it really does."}, {"type": "line", "person": "Tim", "line": "Oh, yeah, yeah. I'm watching this movie, and this is how I felt during Lord of Rings, was how do they do all that special effects? In other words the people that are st- tiny, short, small hobbits. Versus the tall humans. A- all the technology that goes into making this movie kinda makes you go..."}, {"type": "line", "person": "Gregg", "line": "Yeah, well I mean, I wasn't too worried about the details, the nitty gritty, the nuts and bolts. I'm just sitting back with some popcorn enjoying the film, and that's the way you should do it too."}, {"type": "line", "person": "Tim", "line": "Uh, well it's fantastic. You don't need to know about the story. This is the p- original. In fact, if you haven't seen-"}, {"type": "line", "person": "Gregg", "line": "You know the story, if you haven't rea- if you haven't read The Hobbit, what uh, hole have you been living in, a hobbit hole?"}, {"type": "line", "person": "Tim", "line": "But if I have to say one thing about this, is if you haven't seen Lord of the Rings yet, don't bother yet. See Hobbit first, 'cause it is a prequel. And then see rest of Lord of the Rings. Um-"}, {"type": "line", "person": "Gregg", "line": "And see them on the IMAX, because I don't know if there's one in your area. It gives you a real th- you feel it in your bones, the big soundsystem, and visually, it's like you're there-"}, {"type": "line", "person": "Tim", "line": "Yeah."}, {"type": "line", "person": "Gregg", "line": "-in Middle Earth with Bilbo and the gang. It's great."}, {"type": "line", "person": "Tim", "line": "And what about the dragon, Sma- uh Smaug? S M A U G, it's sp-"}, {"type": "line", "person": "Gregg", "line": "Well, he's one of the classic characters of literature-"}, {"type": "line", "person": "Tim", "line": "Yeah, would've been like-"}, {"type": "line", "person": "Gregg", "line": "If you see him on a screen like this, um <inhales in mock fear>"}, {"type": "line", "person": "Tim", "line": "So I'm saying this right now, and everybody better be listening: This is the best film of the year. I'ts gonna win a Oscer. It'll win best picture. Uh, there's no question about it, because Jackson's done it again. He is like the ki- if Michael Jackson's the king of pop, then I'll say Peter Jackson is the King of Movies."}, {"type": "line", "person": "Gregg", "line": "And he's got some Oscers already, so once you break that barrier, they're willing to keep dishing 'em out, especially when you make films that are this audience-friendly, and this Oscer-friendly."}, {"type": "line", "person": "Tim", "line": "Yeah. Uh, great, so we have Hobbit: Unexpected Journley- Ler- Jene- Unexpected Journey. I'm giving it six bags of popcorns and six cans of soda. Uh, cups of soda."}, {"type": "line", "person": "Gregg", "line": "Well, the scale only goes up to five, but I'll give it five bags of popcorn and a big hobbit hug."}, {"type": "line", "person": "Tim", "line": "Alright, well um, we- ah, the other movie we had is Les Miserables- Less Miserable- Le- uh, Les Mis, I guess you can call it. And that's uh, I also give that five popcorn bags-"}, {"type": "line", "person": "Gregg", "line": "Yeah, four or five. Whatever. Great- great music."}, {"type": "line", "person": "Tim", "line": "Okay, let's just jump into the- while we have time, the popcorn uh, classic we have."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics Theme"}, {"type": "line", "person": "Gregg", "line": "Popcorn Classic this week is George Burns in Eighteen Again. Uh, it's a delight for all ages. Um, I can't stop laughing."}, {"type": "line", "person": "Tim", "line": "Mhm."}, {"type": "line", "person": "Gregg", "line": "I love this movie."}, {"type": "line", "person": "Tim", "line": "Alright, thanks again for watching, and enjoy the film!"}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "This is a great movie [...]"}, {"type": "line", "person": "Gregg", "line": "Yeah"}, {"type": "line", "person": "Tim", "line": "[...] the one with Dudley Moore"}], "name": "S01E07"}