{"transcript": [{"type": "line", "person": "Tim", "line": "It's time to have fun at the movies again. We got great guests, interesting conversations, sneak peaks at the latest films, and I gotta tell ya, sometimes, we don't agree on everything. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker, and welcome to our final episode of the year, of On Cinema at the Cinema. And it's our big holiday episode, and it's uh, also the last episode for a while. What an honor it's been to be able to deliver this news to you an- and share my thoughts with you about the movies coming up. It's been a lot of fun putting this show together and I wanna thank the whole cast and crew for making it possible. Including my guest here, who is with me today, named Gregg Turkington. Thank you very much, Gregg, for being on the show."}, {"type": "line", "person": "Gregg", "line": "<tck> Hey guys, great to be here, uh, all year long, really. And uh, hopefully, I'll be keeping this seat warm through many more successful seasons of On Cinema at the Cinema."}, {"type": "line", "person": "Tim", "line": "<chuckles>"}, {"type": "line", "person": "Gregg", "line": "In the meantime, I will be teaching film history classes um, at some of the local community centers in the area."}, {"type": "line", "person": "Tim", "line": "Alright, well, we got a lot to get to, uh, because this is the big holiday issue this week came out Parent- uh, Parental Guidance, with uh, Billy Crystal. And it's been a while since we've seen Billy get on the screen. You got Billy Cry-"}, {"type": "line", "person": "Gregg", "line": "<tck> Not on my screen. I se- I watch a lot of videos of his."}, {"type": "line", "person": "Tim", "line": "Well, we got Billy Crystal, Bette Midler, and Mar- the great Marissa Tomei. And it is a fun, family-friendly, f- funny, uh, family film about a grandfather finds having to take care of his three grandkids and using twenty first century methods <grunts>, he soon resorts to an oldschool style of parenting. Very funny stuff, and I thought this movie was a h- a laugh out loud- e- every minute, there was a new, different kind of laugh and they really did it, they managed"}, {"type": "line", "person": "Gregg", "line": "The whole Billy Crystal Bette Midler uh, pairing has always worked for me in other movies and now in this. Um, and you throw in these three eh- lovable, but, ah, difficult kids-"}, {"type": "line", "person": "Tim", "line": "<laughs>"}, {"type": "line", "person": "Gregg", "line": "and uh, it's just a recipe for fun, especially at the holidays. You know, people don't wanna worry about war and uh, bombs and things, at the holidays. You wanna go to your family to a movie that everyone can enjoy, and in the hands of uh, Bette Midler and Billy Crystal, of course you're gonna enjoy it."}, {"type": "line", "person": "Tim", "line": "Well, I said to my wife this morning, I said I bet the producers of this movie were pissed when they remembered that there was the movie called uh, Three Amigos, because between Billy Crystal, Bette Midler, and Marissa Tomei, those are the three amig- amigos in this movie because of the energy and their comic sensibility and everything-"}, {"type": "line", "person": "Gregg", "line": "Well, speaking of the title, I was thinking uh, on my way here, that it would be really funny if the movie's called Parental Guidance, and then they rated it R."}, {"type": "line", "person": "Tim", "line": "<laughs>"}, {"type": "line", "person": "Gregg", "line": "But uh, it's PG- P- Parental Guidance is PG-"}, {"type": "line", "person": "Tim", "line": "I'm glad it was rated PG- But I'm am glad it was rated PG, though, because it is a movie for the kids, and for families-"}, {"type": "line", "person": "Gregg", "line": "Yeah, no, that's the right rating for it. I'm just saying, it would have been funny if they'd rated it R."}, {"type": "line", "person": "Tim", "line": "...Not my kind of humor."}, {"type": "line", "person": "Gregg", "line": "Or the three amigos could be the three grandkids, too."}, {"type": "line", "person": "Tim", "line": "Anyhow, I'm giving it six bags of popcorn and two s- glasses of soda."}, {"type": "line", "person": "Gregg", "line": "I'd say if you're uh-"}, {"type": "line", "person": "Tim", "line": "And go see it if you wanna have a fun, fresh, exciting, family-friendly, fun film to go see this year. Ok, moving along. We got a lot to get through. Because uh, we wanna talk about our favorite movies of the year as well. Django Chai- uh, Unchained by Quentin Tarantino, Jamie Foxx, Leonardo DiCaprio and Don Johnson star in this t- r- wi- western, uh, with a ver- with slaves in it, and very violent, uh, very violent-"}, {"type": "line", "person": "Gregg", "line": "Very violent. Very violent."}, {"type": "line", "person": "Tim", "line": "Yes, and not my favorite kind of movie around the holidays. I think this was a big mistake on the producer's part to put this out around Christmas."}, {"type": "line", "person": "Gregg", "line": "Halloween would've been more appropriate 'cause that's when you have all your horror and your Frankensteins and that sort of thing-"}, {"type": "line", "person": "Tim", "line": "Right, it's a slasher movie, but a Western movie as well."}, {"type": "line", "person": "Gregg", "line": "It's interesting. I mean uh, I like being thrown for a curve, and uh, Quentin Tarantino always does, and I'm gonna tip my hat to him. This is a great movie."}, {"type": "line", "person": "Tim", "line": "It's one of the best movies I've seen all year, and I'm giving it four bags of popcorn."}, {"type": "line", "person": "Gregg", "line": "Yeah, I thought it was great. DiCaprio is always uh, great to see. I would give it five bags of popcorn and maybe a little toy pistol filled with some uh, soft drink, or something, 'cause it is a little violent-"}, {"type": "line", "person": "Tim", "line": "Anyways, now it's time when we look into the past and decide on what our favorite films of the past year were, and also best and worst, in other words. What was our favorite film, what was our least favorite film. Gregg, what was your favorite film of the year?"}, {"type": "line", "person": "Gregg", "line": "I'm gonna have to say The Hobbit. That was my favorite movie of the year before I'd seen the frame of it. I'm just uh, really excited about The Hobbit, and I've seen it now four times, and I can't wait for it to come out on some sort of home video format. The Hobbit is like the cherry on the Lord of the Rings cake, and to get more Peter Jackson fantasy at this point in time is a real treat, and I think it's at the top of everyone's list, and it will be at the top of Oscer's list, mark my words."}, {"type": "line", "person": "Tim", "line": "Well, I appreciate that, and I loved- as you know, I loved Hobbit, but I'm gonna go with the dark horse here. Jack Reacher was my favorite film of the year, starring Tom Cruise. Uh, it was uh, ah, I didn't- I remember when I reviewed this movie, I thought that I loved it, and I gave it a great review, but I didn't give it enought credit, 'cause I went and saw it again, and it is fabulous, it's Tom Cruise's best movie. It's one o- It's the best movie of the year. I thought that movie was terrific, and I think Tom Cruise should win the Oscer."}, {"type": "line", "person": "Gregg", "line": "It's an excellent film, and I'm not gonna disagree with you. I would-"}, {"type": "line", "person": "Tim", "line": "Now, as far as the worst movie of the year, for me, or the movie that we didn't- that I didn't like as much was Skyfall: James Bond. And uh, I loved all the- some of the scenes with the action, but too many moments in the movie, I was confused about what was going on. I hate-"}, {"type": "line", "person": "Gregg", "line": "Well..."}, {"type": "line", "person": "Tim", "line": "having to go see Bond movies 'cause I always get confused. 'Bout who was the bad guy-"}, {"type": "line", "person": "Gregg", "line": "I"}, {"type": "line", "person": "Tim", "line": "And th- there's no reason to be confused when you're seeing a movie. They should always be fun, and Skyfall gets my no bags popcorn."}, {"type": "line", "person": "Gregg", "line": "Well, that was one of my favorite movies of the year, because I love James Bond. That was probably the best of the Bond movies-"}, {"type": "line", "person": "Tim", "line": "Well, it's not an argument-"}, {"type": "line", "person": "Gregg", "line": "If you don't like this movie, you don't like James Bond-"}, {"type": "line", "person": "Tim", "line": "It's not an ar-"}, {"type": "line", "person": "Gregg", "line": "Because this is a- one of the best James Bond movies. Uh-"}, {"type": "line", "person": "Tim", "line": "It's not an argument about the movie itself. You just pick what was your least favorite movie. Don't defend Skyfall."}, {"type": "line", "person": "Gregg", "line": "Uh... Jack Reacher. With Tom Cruise. Just Not- not a good film. Just..."}, {"type": "line", "person": "Tim", "line": "You gave it a great review when we reviewed it, so that's [...] spiteful"}, {"type": "line", "person": "Gregg", "line": "Well, I saw it again since then, and I didn't like it. It's just, you know. It's amateurish, it's junk."}, {"type": "line", "person": "Tim", "line": "Well, I loved it. It's my favorite movie of the year. Um-"}, {"type": "line", "person": "Gregg", "line": "Well, you didn't see it then, 'cause it's crap."}, {"type": "line", "person": "Tim", "line": "I saw it three times."}, {"type": "line", "person": "Gregg", "line": "Well, I saw it twice, and the first time, I thought it was okay. The second time the flaws became apparent. I would not watch it a third time."}, {"type": "line", "person": "Tim", "line": "Well, alright. I think you're uh, I think you're being a little hard on it because I said some bad things about Skyfall. But that's what happens-"}, {"type": "line", "person": "Gregg", "line": "Well, Skyfall got great reviews. Jack Reacher: mixed reviews."}, {"type": "line", "person": "Tim", "line": "...<sighs> Alright, well I don't know what to tell you. Um, alright, well, why don't we just disagree to disagree. Let's uh, throw it to another segment. On Cinema: On Location. Just show that."}, {"type": "stage_direction", "stage_direction": "On Cinema: On Location Intro"}, {"type": "line", "person": "Gregg", "line": "Hey guys! Welcome to On Cinema: On Location. We're in front of the Blast from the Past house. If you remember the great movie from nineteen ninety nine, starring Alicia Silverstone, Brendan Fraser, and Sissy Spacek, from Coal Miner's Daughter, in a rare comedic role. Blast from the Past. This is the house where Alicia Silverstone's character, Eve, lived and spent many great moments with Brendan Fraser, the star of the picture. Uh, Blast from the Past, and uh, thanks again uh, for tuning in to On Cinema: On Location, and, uh, keep tuning in. We'll see a lot of interesting locations. Back to you T-"}, {"type": "line", "person": "Tim", "line": "Alright, well thank you guys very much. It's been a great time putting this show together for you, and we uh, we really do appreciate it, so have a great year, and hopefully we'll see ya next year."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "And enjoy the film."}], "name": "S01E10"}