{"transcript": [{"type": "line", "person": "Tim", "line": "I love this movie! Skip it. You're gonna wanna see this one in the theaters. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, I'm Tim Heidecker and you're watching On Cinema at the Cinema. Thanks for watching. This is the webisode where we talk about what movies are coming out this weekend and hopefully, uh, recommending some for you or telling you which ones to stay away from. Uh, my guest this week is a film buff, and I'm really happy to have him on this show, is Gregg Turkington"}, {"type": "line", "person": "Gregg", "line": "<tck> Hey guys. Good to be back in my chair, On Cinema, uh, at the movies."}, {"type": "line", "person": "Tim", "line": "Yeah. Er, um, well listen, thanks very much for coming, and-"}, {"type": "line", "person": "Gregg", "line": "Oh, yeah"}, {"type": "line", "person": "Tim", "line": "-we got a couple of- couple of cool movies to talk about today, uh-"}, {"type": "line", "person": "Gregg", "line": "Very cool."}, {"type": "line", "person": "Tim", "line": "Playing for Keeps is a movie directed by Gabrielli Mucconi- Miccieni- Muc- Muccini. And that's uh, with Gerald Butler, Jessica Biel, and my favorite actor, Dennis Quaid. Um, it's a really great coming of age kind of movie about soccer and about Gerald Butler really reinventing who he is as a man, and of course a lot of great romance, comedy, and sports. Uh, I thought it was really fun. It really took the edge off for me, and it was a really a nice clean, pleasant, fun movie if you like soccer and- and movies about soccer-"}, {"type": "line", "person": "Gregg", "line": "Which I do. This is a cool movie. People will like this movie, um, you know I hadn't heard of it until I saw the ads and then went to see it, and I flipped over it, and it will be a movie that I will add to my library when it is made available on DVD or-"}, {"type": "line", "person": "Tim", "line": "I- I thought Dennis Quaid was terrific in this and-"}, {"type": "line", "person": "Gregg", "line": "I loved hi- I mean I love Randy Quade too. He wasn't in this, but he's also a very fine actor. There's something in that Quade blood."}, {"type": "line", "person": "Tim", "line": "Yeah. well, uh, Playing for Keeps gets my four bags of popcorn."}, {"type": "line", "person": "Gregg", "line": "I'm gonna give it four bags of popcorn and a hotdog, 'cause that's what you'd eat if you went to see a sporting event, and a lot of the movie does take place in uh, the world of professional sports."}, {"type": "line", "person": "Tim", "line": "Uh, our second movie is uh, it's kind of a coincidence 'cause several weeks ago- a few weeks ago, we were talking about another movie about presidents. This one is called Hyde Park on the Hudson, about another famous US president named... Franklin Roosevelt. And it stars, surprisingly, Bill Murray, uh, as President Oba- uh, Ore- Uh, pf- President Franklin D. Relsevelt- Uh- uh, President-"}, {"type": "line", "person": "Gregg", "line": "Roosevelt, yeah"}, {"type": "line", "person": "Tim", "line": "-Franklin Roosevelt, sorry. Uh, -sent Frank- FDR, yeah, of course. Um... What was I thinking? Oh, so it stars..."}, {"type": "line", "person": "Gregg", "line": "Stars Bill Murray!"}, {"type": "line", "person": "Tim", "line": "Stars Bill Murray, and people are thinking, well, is it a comedy? No, it's not. But it is a lot of great heart to it. Uh, this movie blew me away. I thought it was so funny. Not funny, but... well done. And Overvel- Roosevelt was one of our... uh... first presidents. Er..."}, {"type": "line", "person": "Gregg", "line": "Well, he wasn't one of the fir- He was one of the best, and Billy Murray's one of our best actors. And so it makes sense that they would come together in these-"}, {"type": "line", "person": "Tim", "line": "<sneezes> Mm. 'Scuse me."}, {"type": "line", "person": "Gregg", "line": "And um, this is no meatballs. It's not a gross out comedy. It's actually a very serious film about a very serious issue-"}, {"type": "line", "person": "Tim", "line": "I was f- It was alway funny to see Roosevelt with the c- the cigarette in the cigarette holder."}, {"type": "line", "person": "Gregg", "line": "Yes, yes."}, {"type": "line", "person": "Tim", "line": "And uh, I thought Bill Murray was gonna ham it up a little more than he did. And I'm also gonna add that I uh, think this is your movie to win. The Oscers. At least Bill Murray-"}, {"type": "line", "person": "Gregg", "line": "It's always been a bone of contention with me that there isn't a best actor in a comedy award, and if there was one, Bill Murray I think would a whole mantlepiece covered with these things. But when he does get dramatic, which he does very well, in every case, I think, he's deserved the Oscer, and I think this is finally the year where he's gonna get one, and thank God for that."}, {"type": "line", "person": "Tim", "line": "It will be Oscer sweet Revenge-"}, {"type": "line", "person": "Gregg", "line": "Director. The director could probably win for this. Um-"}, {"type": "line", "person": "Tim", "line": "Roger Michell, and it will be Oscer's-"}, {"type": "line", "person": "Gregg", "line": "Bill Murray should've won before, but-"}, {"type": "line", "person": "Tim", "line": "-It'll be Oscer's sweet revenge that he wins best actor when he was not nominated for other movies that he was in. That's uh, our movies this week. Um, both great movies. Check 'em out. Different movies, uh, but we really did enjoy both of them. Uh, right now we're gonna show you guys a-"}, {"type": "line", "person": "Gregg", "line": "Five tubs of- er, how many..."}, {"type": "line", "person": "Tim", "line": "Just let me finish- let me get to the On Location segment that you want me to do. <exhales> Alright, we did this a few weeks ago. It was such a successful segment, we're doing it again. Gregg has asked uh, to go and do this, and it's a segment called On Cinema: On Location."}, {"type": "line", "person": "Gregg", "line": "Very proud of these..."}, {"type": "stage_direction", "stage_direction": "On Cinema: On Location Intro"}, {"type": "line", "person": "Gregg", "line": "Hey guys, welcome to another segment of On Cinema's On Location. Uh, the segment where we take a look at famous locations from great movies and classic movies. Today, we're looking at the hotel that was seen in the movie Moment by Moment. Starring John Travolta and Lily Tomlin. If you've seen the movie, you know that this hotel is where John Travolta's buddy Gregg lives, and where Lily Tomlin comes to try to find John Travolta after a spat. So it's a classic movie, classic location. Uh, back to you, Tim!"}, {"type": "line", "person": "Tim", "line": "...Alright. Uh, s-"}, {"type": "line", "person": "Gregg", "line": "Thank you."}, {"type": "line", "person": "Tim", "line": "Thank you very much, Gregg, for that report, and uh, once- one more time, Playing for Keeps gets four bags of popcorn from me."}, {"type": "line", "person": "Gregg", "line": "<tck> I will give it four as well."}, {"type": "line", "person": "Tim", "line": "And Hyde Park on Hudson getting five bags of popcorn with two sodas um, from me."}, {"type": "line", "person": "Gregg", "line": "Five bags of popcorn and... as many Oscers as you can give. Director, film, actor, actress, screenplay, and even the score was quite good."}, {"type": "line", "person": "Tim", "line": "Thanks for uh, coming on the show."}, {"type": "line", "person": "Gregg", "line": "Good to be here."}, {"type": "line", "person": "Tim", "line": "And uh, we'll see you guys next week. Enjoy the film."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "I thought it was- I thought this one was actually pretty good. [...] than I was expecting."}, {"type": "line", "person": "Gregg", "line": "Yeah, yeah. Well with Bill Murray it's..."}, {"type": "line", "person": "Tim", "line": "Are we still rolling? 'Cause I was gonna say we- uh, if Steven Spielberg directed Hyde Park on the Hudson movie... kind of a cool idea."}], "name": "S01E06"}