{"transcript": [{"type": "line", "person": "Tim", "line": "This is a great movie, you're not gonna regret it. You're gonna wanna skip this movie. Have you ever wondered what movie should I see this weekend? Well, we're here to help. It's On Cinema at the Cinema."}, {"type": "line", "person": "Tim", "line": "Hi everybody, happy Thanksgiving. My name is Tim Heidecker, welcome to another episode of On Cinema at the Cinema. It's a new webseries where we talk about what movies are coming out this weekend and hopefully give you guys a little advice about what's worth seeing and what's uh, worth staying away from. Every week I bring on a guest, and today my"}, {"type": "line", "person": "Gregg", "line": "Tck, hey guys. Always good to be here as a regular guest."}, {"type": "line", "person": "Tim", "line": "This week, we've got two movies to talk about. And by the way, happy Thanksgiving everybody. I always love going to see movies around Thanksgiving. Uh, because the family's around and sometimes we'll just say, you know, instead of doing the dishes after Thanksgiving meal, let's just go see a movie. So we'll all go out to the cinema. Uh-"}, {"type": "line", "person": "Gregg", "line": "It's fun."}, {"type": "line", "person": "Tim", "line": "The first movie is a remake called Red Dawn, which is a movie about people who are uh, being attacked by Russians. With this case, it's a North Koreans. And these teenagers fight back and I won't give away the ending, but it's a happy ending. So um, they're attacked by Russia, or Korea, and there is uh- it is a remake and it's um, a lot of tension, a lot of action, lotta great acting, and a lotta fun."}, {"type": "line", "person": "Gregg", "line": "Did you ever see the original with uh, uh, Brigitte Nielsen I think was in it? And uh, it's- it's on video. You've gotta-"}, {"type": "line", "person": "Tim", "line": "Yeah, I've seen the original."}, {"type": "line", "person": "Gregg", "line": "-have seen the original."}, {"type": "line", "person": "Tim", "line": "So that's Red Dawn-"}, {"type": "line", "person": "Gregg", "line": "Did you like or uh..."}, {"type": "line", "person": "Tim", "line": "Ah, I like- I always prefer the remakes, because uh, it's a better movie and uh, you can tell, 'cause of CGI and the technology."}, {"type": "line", "person": "Gregg", "line": "And no commercials. When you watch the originals, it's usually on TV and you have to sit through a lot of commercials, so it's fun just to go to the movies and watch it the way the filmmakers intended."}, {"type": "line", "person": "Tim", "line": "Right. Uh, and they don't cut out the scenes with boobs and curse words and everything too."}, {"type": "line", "person": "Gregg", "line": "Also, we got to see this one, this was kind of special, we got to see this couple days before it came out, special sneak preview and that was the first time I've been to a Hollywood sneak preview and it was kind of cool."}, {"type": "line", "person": "Tim", "line": "Nyeah. Well a lot of times you'll get invited uh, to see whether or not the movie's working, and sometimes they'll change movies, they've got uh, like a focus group. Um-"}, {"type": "line", "person": "Gregg", "line": "Well, this one is good, so there was no reason to tinker with success."}, {"type": "line", "person": "Tim", "line": "Right. So I'm giving Red Dawn five popscorn- uh, five bags of popcorn and it's uh, and no sodas."}, {"type": "line", "person": "Gregg", "line": "I'm gonna give it four bags of popcorn and maybe just a cup of water."}, {"type": "line", "person": "Tim", "line": "...And it's directed by Dan Bradley, so..."}, {"type": "line", "person": "Gregg", "line": "And it's definitely a popcorn movie, there's a lot of thrills and chills and spills, and we like that sort of thing on this show. And good cinematography, and um, you know, it's a long movie, but it- time flies when you're having fun. I had a lot of fun at Red Dawn, and I think you will too."}, {"type": "line", "person": "Tim", "line": "It's R E D D A W N, not D O N... <Tck> Alright, our next movie on the list is eh, called Life of Pi. And I know what you're thinking. Mmm, desert, pie, but this is actually the- the uh desser- not dessert, it's the P I from math. Uh, and it's based on a book- Not private detective either. Uh, it's uh- which... suppose would be a good idea for a movie. Uh, be interesting to see what a PI does."}, {"type": "line", "person": "Gregg", "line": "If you've seen Fletch?"}, {"type": "line", "person": "Tim", "line": "...Yes."}, {"type": "line", "person": "Gregg", "line": "Fletch, Chevey Chase"}, {"type": "line", "person": "Tim", "line": "Or Bogey."}, {"type": "line", "person": "Gregg", "line": "Bogey."}, {"type": "line", "person": "Tim", "line": "Uh, from the Bogey movies. Um, Life of Pi. Didn't know much about this movie and uh, this is based on a very popular book about an Indian boy who's trapped on a boat with a lion or a tiger, something like that. And this was a weird movie for sure, one of the weirdest movies I think I've ever seen. Uh, had a very philosloph- philosophical touch to it, And I appreciated the acting, and I loved this movie!"}, {"type": "line", "person": "Gregg", "line": "Well, with all the animals in it, they could have called it Animal House Two-"}, {"type": "line", "person": "Tim", "line": "Hahahaha"}, {"type": "line", "person": "Gregg", "line": "-because it's just filled with animals, and if you love animals, if you're an animal-lover, and I know I am, you'll like this movie. Um, I liked the Fletch movies better, but I would still recommend this."}, {"type": "line", "person": "Tim", "line": "You have to admit that it was really weird."}, {"type": "line", "person": "Gregg", "line": "It's very strange, but I've seen a lot of strange movies. Um, uh, one of my all time favorite movies is Napoleon Dynamite, and uh, doesn't get much weirder than that. But this one tries and it's a lot of fun. Um, I wouldn't say it's for everyone. Probably someone that's looking for a sports movie wouldn't like this movie, but the rest of you will, so go check out Life of Pi."}, {"type": "line", "person": "Tim", "line": "Well, Life of Pi, very weird but very well done by the great cinematographer-director Ang Lee and I think I'm- this is gonna be definitely got my vote if anyone's voting for Oscer, this is gonna win Oscer and I gi-"}, {"type": "line", "person": "Gregg", "line": "'s a little- it's a little too weird for the Oscers but-"}, {"type": "line", "person": "Tim", "line": "I give it si- uh, four popcorn bags. So check it out if you like the weird stuff."}, {"type": "line", "person": "Gregg", "line": "I'm gonna give it... five bags of popcorn and, I don't know, some sort of strange snack."}, {"type": "line", "person": "Tim", "line": "How about uh..."}, {"type": "line", "person": "Gregg", "line": "Like salt uh, have you had those uh, those little crackers that are wrapped in seaweed."}, {"type": "line", "person": "Tim", "line": "Uh yeah, like tofu."}, {"type": "line", "person": "Gregg", "line": "Hehe. Yeah, no, they're just crackers."}, {"type": "line", "person": "Tim", "line": "Alright. Uh, well if you can't make it out to the film this weekend, you got too many dishes to wash after Thanksgiving, uh-"}, {"type": "line", "person": "Gregg", "line": "If you're not working, you should be able to get to the pictures this weekend."}, {"type": "line", "person": "Tim", "line": "Alright."}, {"type": "line", "person": "Gregg", "line": "'cause nobody works on Thanksgiving."}, {"type": "line", "person": "Tim", "line": "Uh, we do this segment every once in a while, called Popcorn Classics and Gregg has brought in a movie from his home library to recommend."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics Theme"}, {"type": "line", "person": "Tim", "line": "Gregg, what have you brought in this week?"}, {"type": "line", "person": "Gregg", "line": "I'd say put the dishes in the dishwasher, turn it on, and reach into your video cabinet and pull this thing out as I did. Um, we um, this is Twilight Zone: The Movie. Now last week, we talked about the Twilight Saga, and this is sort of the original Twilight Saga, the Twilight Zone. Uh, it was a TV show, and it was very different from the Twilight that we know today. Uh, the Twilight saga came from a popular series of books."}, {"type": "line", "person": "Tim", "line": "Alright. Well that- so that was based on the TV show then the Twilight Zone and then..."}, {"type": "line", "person": "Gregg", "line": "The Twi- the Twilight Zone: The Movie is based on Twilight Zone, the TV series."}, {"type": "line", "person": "Tim", "line": "Ok."}, {"type": "line", "person": "Gregg", "line": "And Twilight- uh, the Twilight movies are based on books, have nothing to do with this movie, which stars Dan Aykroid."}, {"type": "line", "person": "Tim", "line": "Alright... Alright, well if you wanna get a copy of Twilight Zone: The Movie, check out Blockbuster or the video stores uh, or maybe it's even gonna be on TV-"}, {"type": "line", "person": "Gregg", "line": "Amazon.com or Ebay is a place you can bid, uh, you place your bid, and if your bid's accepted, then you pay for it. You don't pay for it until then."}, {"type": "line", "person": "Tim", "line": "Alright, well, if you are going to see the movies, we both recommend Red Dawn and Life of Pi. I gave Red Dawn..."}, {"type": "line", "person": "Gregg", "line": "Five, you gave it five."}, {"type": "line", "person": "Tim", "line": "I gave four bags of popcorn and one soda, and Life of Pi, I gave five bags. And two sodas."}, {"type": "line", "person": "Gregg", "line": "And I gave Red Dawn four bags, and Life of Pi five bags and watch 'em both if you can."}, {"type": "line", "person": "Tim", "line": "Ooh, a double feature. Thanks again for watching, and enjoy the film."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "It's important to remember [...]"}], "name": "S01E04"}