{"transcript": [{"type": "line", "person": "Tim", "line": "This is a great movie. You're not gonna regret it. I'm Tim Heidecker. Great guests, great conversations, and a few arguments. It's On Cinema At the Cinema"}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker. Welcome to another episode of On Cinema at the Cinema. It's a web series where we talk about what movies are coming out this weekend, give you guys some advice as to what uh, we love, and uh, what we don't like, so um, I gotta big special guest for you guys today. Um, he's done the show before and he's a film buff and his name is Gregg Turkington. Thanks for coming on the show today."}, {"type": "line", "person": "Gregg", "line": "Hey guys! Always a pleasure to take my seat at the On Cinema screen room, and thanks to all of you who are sending in cards and letters asking to have me on more often."}, {"type": "line", "person": "Tim", "line": "Hm. Well uh, we've got two movies, and you might say ladies get in free, half price, or uh, uh, what's the expression, ladies night-"}, {"type": "line", "person": "Gregg", "line": "It's ladies night."}, {"type": "line", "person": "Tim", "line": "Ladies night. Uh, 'cause we got Twilight Saga: Breaking Dawn Part 2. Uh, which stars, uh, Kristen Stewart, Robert Pattinson, directed by Bill Condom, and it's just, uh, another one of these vampire movies, I guess. And it's romantic, and it's uh, full of uh, these sort of situations, uh, which is it turns out to be that's very interesting, uh, very... scary at times, but also a lot of romance and uh, really well-made, so I recommend it-"}, {"type": "line", "person": "Gregg", "line": "Good soundtrack."}, {"type": "line", "person": "Tim", "line": "Good soundtrack."}, {"type": "line", "person": "Gregg", "line": "Lotta good songs and cinematography if you're a film buff, you notice things like that. It's very misty and murky."}, {"type": "line", "person": "Tim", "line": "Mhm"}, {"type": "line", "person": "Gregg", "line": "Um-"}, {"type": "line", "person": "Tim", "line": "You could tell that they shot a lot of this stuff in the woods and certain locations that really worked."}, {"type": "line", "person": "Gregg", "line": "Yeah, it's- it's not the kind of film I would normally go see. I haven't seen the previous one, so it was hard to follow the plot. Not a lot of car crashes in this film-"}, {"type": "line", "person": "Tim", "line": "Hmhm"}, {"type": "line", "person": "Gregg", "line": "But uh-"}, {"type": "line", "person": "Tim", "line": "I loved it, I thought it was great. Um, would be a great movie to see with friends. I'm giving it f-"}, {"type": "line", "person": "Gregg", "line": "Or by yourself."}, {"type": "line", "person": "Tim", "line": "Great. Uh, I'm giving it, Twilight Saga: Brown uh, sag- saga- Tilight s- uh"}, {"type": "line", "person": "Gregg", "line": "Saga- It's Twilgiht Saga:-"}, {"type": "line", "person": "Tim", "line": "Twilight Saga: Breaking Dawn-"}, {"type": "line", "person": "Gregg", "line": "Break- Breaking Dawn Part Two."}, {"type": "line", "person": "Tim", "line": "Uh, four bags of popcorn and uh, how about you?"}, {"type": "line", "person": "Gregg", "line": "I'm gonna give it four bags of popcorn with reservations that if you haven't seen the others, uh, you might wanna brush up on 'em before you go see this one."}, {"type": "line", "person": "Tim", "line": "The nother one is another chick flick as you might call it called Ran- Anna Kerinina. Anna Kinina. Anna Kerenina. Starring-"}, {"type": "line", "person": "Gregg", "line": "Kerina"}, {"type": "line", "person": "Tim", "line": "Kiera Knightly, Jude Law, and this is an adaptation about Russians uh, from a book. And it's a classic chick flick I guess. Sometimes those movies are not great, but this one is. It's about Tolsto- Uh rol- Uh, Lu- Lu- Leo Tolstoy wrote the book and it's set in Russia and um, that's about it. So this is about Anna Karenina, and it's very uh, well done, well made, I love this movie."}, {"type": "line", "person": "Gregg", "line": "And it's a period piece, and it's a sort of an important film in that it wouldn't've been possible to make this a few years ago when we were at war with Russia and there was that whole thing. So it's sort of groundbreaking in that sense and I think you should see it"}, {"type": "line", "person": "Tim", "line": "Interesting to hear- also interesting to hear the uh, American and Eng- and English like, Jude Law for example. Uh, I thought to myself: Hmm, he's not Russian, how is he gonna play it and he ended up doing a great job doi- being able to do the accent. Uh, it's not, by the way, no subtitles required. This is all in English, so you don't have to worry about reading for the whole movie, which sucks. And-"}, {"type": "line", "person": "Gregg", "line": "Oscers: Uh, I think there will be a few. This is the type of movie that Oscer loves to award. And what greater reward would there be than to get an Oscer, so-"}, {"type": "line", "person": "Tim", "line": "Well, if it doesn't win, it's certainly gonna be nominated, that's a guarantee. Um-"}, {"type": "line", "person": "Gregg", "line": "It will win."}, {"type": "line", "person": "Tim", "line": "Um. Alright, so Anna Karenina gets five bags of popcorn from me."}, {"type": "line", "person": "Gregg", "line": "You gotta give it five. Um, it'll be nominated, it'll take home a few statuettes and that's what it's all about."}, {"type": "line", "person": "Tim", "line": "Alright, so now we're gonna do something a little different. Uh, since we are making this uh, show in Ca- Los Angeles, California, Uh, Gregg has gone out and made some uh, a film here about some um really famous locations I guess, where a lot of famous movies have been shot. So let's take a look at this, called On Cinema: Uh, O-"}, {"type": "line", "person": "Gregg", "line": "On Cinema On Location, it's it's our-"}, {"type": "line", "person": "Tim", "line": "On Cinema: On Location"}, {"type": "line", "person": "Gregg", "line": "newest segment, and hopefully a popular one."}, {"type": "line", "person": "Tim", "line": "Let's take a look."}, {"type": "stage_direction", "stage_direction": "On Cinema: On Location Intro"}, {"type": "line", "person": "Gregg", "line": "Hey guys, welcome to another segment of On Location with On Cinema. Today, we're at a very famous movie site. This is the cemetery lake where the film Hotshots, from 1991, starring Charlie Sheen, was shot. Uh, you may remember the scene that all took place right here and uh, really hasn't changed. Back to you."}, {"type": "line", "person": "Tim", "line": "Alright, very interesting. I didn't know that. That's uh, go check out that site if you're ever in Los Angeles. Uh, just-"}, {"type": "line", "person": "Gregg", "line": "It's fun to be behind the camera. Of course, I've done the podcast, now the show, and then to get behind the camera and in front of the camera and make little film like that is a treat."}, {"type": "line", "person": "Tim", "line": "Well, really it's almost uh, more valuable than going on one of those Hollywood bus tours... Thanks for watching and uh, just to recap: Twilight Saga: Breaking Dawn Part Two is getting four bags of popcorn from me, and Anna Karenina getting the five pops."}, {"type": "line", "person": "Gregg", "line": "Yeah I'm gonna have to say four and five as well. I don't like to just uh, parrot your opinions, but in this case, you're right."}, {"type": "line", "person": "Tim", "line": "Alright. Thanks again for watching, and we'll see you next week. Enjoy the film."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "Yeah, did you think that was long?"}, {"type": "line", "person": "Gregg", "line": "Anna Karenina is not getting [...]"}], "name": "S01E03"}