{"transcript": [{"type": "line", "person": "Tim", "line": "I love this movie! I'm Tim and you're watching On Cinema at the Cinema. Quiet on set!"}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker and welcome to the first episode of my new show On Cinema at the Cinema. It's a webshow, it's the first of its kind where we talk about movies coming out this weekend and give you guys a little advance knowledge as to whether or not these are good movies that you should go check out or movies that you should just wait - actually wait for them to come out on video or even not even see. Uhh, it's gonna be a lot of fun, I'm really excited about the opportunity here and uhh, wanna welcome my first guest, uhh, he's a film buff and I'm really glad to have him on the show, and it's gonna be fun to talk to him. Mister Gregg Turkington. Gregg, thanks for coming on the show"}, {"type": "line", "person": "Gregg", "line": "Hey guys! Umm, congratulations on the TV series!"}, {"type": "line", "person": "Tim", "line": "Thanks very much! Uhh, this is our first episode, so we're sorta working out the kinks and having a lot of fun doing it as well. Uhh, the first movie we're gonna be talking about today is called The Man With The Iron Fists."}, {"type": "line", "person": "Gregg", "line": "Yes"}, {"type": "line", "person": "Tim", "line": "And uh, this is directed by RZA, and it stars, uh, Russell Crowe, and uh -"}, {"type": "line", "person": "Gregg", "line": "Lucy Liu!"}, {"type": "line", "person": "Tim", "line": "And Lucy Liu, correct. I'll do the introductions of-"}, {"type": "line", "person": "Gregg", "line": "Ok"}, {"type": "line", "person": "Tim", "line": "Er, I'll do the synopsis of the movie. And uh, it stars Russell Crowe, [error] Cung Le, and Lucy Liu, and Pam Greer. And um, this is basically it's a feud- in feudal China, a blacksmith, uhh, who makes weapons for small villages, it's karate kind of movie"}, {"type": "line", "person": "Gregg", "line": "Yeah."}, {"type": "line", "person": "Tim", "line": "Um, and for a first time director, it's unbelievable that he was able to get so much footage out of this and shoot so many great scenes. I loved this movie. What'd you think?"}, {"type": "line", "person": "Gregg", "line": "I think Russell Crowe is always gonna be someone to watch. When he's on the screen, he lights up the whole room and this film is no exception. Kudos to Russell Crowe and we hope we'll be seeing more of him. It's been a while since I last saw him."}, {"type": "line", "person": "Tim", "line": "That's right, and it's been, uhh, can't remember the last movie he was in, but it was probably a great one, and-"}, {"type": "line", "person": "Gregg", "line": "Gladiator or something else. He's been busy, probably working on this film. But uh, at last we see the fruits of his labor, The Man With The Iron Fists"}, {"type": "line", "person": "Tim", "line": "Alright, well if you like martial arts, this is the movie for you, starring Russell Crowe, directed by [error] RZA and I'm giving it four popcorn - four bags of popcorn and uh, one soda. Gregg?"}, {"type": "line", "person": "Gregg", "line": "I like I like mar- martial arts, but I don't think you need to like them, uh, to like this movie. If you like Russell Crowe or Lucy Liu, you'll also like this movie. I'm gonna give it five tubs of popcorn a couple of sodas, 'cause it is just that good, whether you see it in 3D, as some did, or 2D, as I did."}, {"type": "line", "person": "Tim", "line": "Alright, well the next movie on our list is Flight starring Robert Zemeckis and Denzel er uh directed by Robert Zemeckis and starring Denzel Washington, John Goodman, and somebody named Kelly Reilly"}, {"type": "line", "person": "Gregg", "line": "She was good."}, {"type": "line", "person": "Tim", "line": "She was great, and um, this movie was phenomenal. Uh, it's gotta be winner of Best Picture this year. It's got planes and it's about a plane crash. Denzel Washington plays a man who is a pilot of planes. I thought this was a great movie. It had me on the edge of my seat the entire time. 'Cause it was one of those movies, I thought, I don't know how this is gonna turn out, and I love this movie. Gregg?"}, {"type": "line", "person": "Gregg", "line": "Uh, John Goodman should be renamed John Greatman after this because he's uh, Oscer-worthy as he often is-"}, {"type": "line", "person": "Tim", "line": "It was good to see Robert Zemeckis back. Of course, he's made so many great movies throughout time-"}, {"type": "line", "person": "Gregg", "line": "Back to the Future and of course the whole trilogy, the Back to the Future 2, and also the third one."}, {"type": "line", "person": "Tim", "line": "Back to the Future 3."}, {"type": "line", "person": "Gregg", "line": "Um, this was a departure for Zemeckis. If you've seen Back to the Future, that's sort of uh, for kids of all ages, uh, I think kids would be a little scared by this. I wasn't, but be careful when bringing children to this film, that's my warning."}, {"type": "line", "person": "Tim", "line": "And I loved Denzel Washington. He kind of reminds me of Russell Crowe, speaking of the other movie we talked about earlier, Um-"}, {"type": "line", "person": "Gregg", "line": "The great actors are all kind of the same in a way, that they have that kind of talent and they know how to use it."}, {"type": "line", "person": "Tim", "line": "Right. Alright, so Flight starring Denzel Washington, directed by Robert Zemeckis, and it is uh, a great movie this F- one of the great movies this Fall. I'm giving it five bags of popcorn and two sodas."}, {"type": "line", "person": "Gregg", "line": "I liked it. Um, I would say probably four bags of popcorn, but because John Goodman is one of the stars and he likes to eat, let's upgrade it to five."}, {"type": "line", "person": "Tim", "line": "Alright."}, {"type": "line", "person": "Gregg", "line": "And a candy bar."}, {"type": "line", "person": "Tim", "line": "Alright, well I think we should just keep the ratings based on whether you liked the movie, and the more- not based -"}, {"type": "line", "person": "Gregg", "line": "Right, I loved the movie."}, {"type": "line", "person": "Tim", "line": "Alright. So, two great movies to see this weekend. But if you don't plan on going to see the movies this weekend uh, Gregg here has a new segment uh, all the segments here are new, it's the first episode, but this one is called Popcorn Classics."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics Theme"}, {"type": "line", "person": "Tim", "line": "Gregg Turkington has brought in a VHS tape from his vast collection and uh, Gregg, what have you brought in to recommend this week?"}, {"type": "line", "person": "Gregg", "line": "Today on my segment, we're looking at Multiplicity. Starring Andi McDowell and Michael Keaton. Uh, this is Michael Keaton's finest hour- Well, finest two hours. Or finest-"}, {"type": "line", "person": "Tim", "line": "What is the running time?"}, {"type": "line", "person": "Gregg", "line": "Hundred and"}, {"type": "line", "person": "Tim", "line": "Usually it says right on the back."}, {"type": "line", "person": "Gregg", "line": "Maybe it's on the tape? Hundred and seventeen minutes, so it is his finest two hours, give or take a couple- well, three minutes. Now, this film is interesting in that they have cloned uh, Michael Keaton. And for anyone who's ever seen Michael Keaton and knows what a national treasure he is, you'd have to agree that having a hundred Michael Keatons is not just a great idea for a movie, but would be a great idea for Hollywood 'cause uh, then we could have him in a lot of movies at once, and that would be a treat."}, {"type": "line", "person": "Tim", "line": "Right. Well I wish they had cloned-"}, {"type": "line", "person": "Gregg", "line": "Uh"}, {"type": "line", "person": "Tim", "line": "a hundred [error] Andy McDowells"}, {"type": "line", "person": "Gregg", "line": "Andy McDowells? Well, I think fifty would be plenty for her. She hasn't had quite the career that Michael Keaton has. But uh, the film's great. And I'd like to clone a hundred copies of this and give one to everyone I know so that they could have a nice Summer weekend at home. Make some time this weekend to see Multiplicity."}, {"type": "line", "person": "Tim", "line": "Right. Alright, well Multiplicity. Check it out. It must be available at uh, in wide release uh, on VHS-"}, {"type": "line", "person": "Gregg", "line": "I got it on VHS, I think it's also on DVD."}, {"type": "line", "person": "Tim", "line": "Alright, well thank you very much, Gregg, for being on the show, and thank you all for watching. Just to go back and look, uh, Man with the-"}, {"type": "line", "person": "Gregg", "line": "Hope you guys liked the new segment"}, {"type": "line", "person": "Tim", "line": "Uh, going to back, The Man with the Iron Fists gets four bags of popcorn and one soda from me"}, {"type": "line", "person": "Gregg", "line": "And I would duplicate that."}, {"type": "line", "person": "Tim", "line": "And Flight gets five bags of corn and two sodas from me. Gregg?"}, {"type": "line", "person": "Gregg", "line": "Uh, it's off the scale for me, I thought it was a great film. I'm giving it the five, but I'm throwing in an extra tub of popcorn for Mister John Goodman, who deserves a meal after his great acting job."}, {"type": "line", "person": "Tim", "line": "Well, uh, thanks again for watching. This is our first episode. We really appreciate you checking it out. Thanks to you, Gregg for being part of the first episode. And-"}, {"type": "line", "person": "Gregg", "line": "And many more, I hope."}, {"type": "line", "person": "Tim", "line": "And we'll see you, uh and enjoy the film, whatever film you see."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "So uh, I think [...]"}], "name": "S01E01"}