{"transcript": [{"type": "line", "person": "Tim", "line": "Three bags of popcorn! four bags of popcorn! five bags of popcorn! five bags of popcorn, two sodas! It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, this is Tim Heidecker and you're watching On Cinema at the Cinema. It's a weekly pod- web- it's actually not a podcast, a webisode. Where we talk about what movies are coming out that we- this weekend, and we also give you some advice, whether or not you should see 'em or not. Uh, my guest this week is uh, Mister Gregg Turkington. Gregg, thanks for comin' on the show."}, {"type": "line", "person": "Gregg", "line": "<tck> Hey guys, glad to be of service, uh, giving some insights and behind the scenes information on some of the new movies. And good to be here with you, Tim, and also good to be showing one of my short films later in this episode-"}, {"type": "line", "person": "Tim", "line": "Well, let's not cut to that yet. Alright. Uh, movie first- the one first movie we're gonna wa- uh talk about is Zero Dark Thirty, which is a documentary about the son- hunt for La- Osama Bin Laden, one of the original bad guys in cinema. And in the world. And uh, as alwa- as we all remember, so many years ago, uh, couple years ago, we had the death of Osama Bin Laden, killed in action after uh, we spent years hunting him for the murder of nine eleven and who's responsible for terrible terror. And uh, mend- about the men and women who did take him out and killed him. And uh, all the work that went into going through that with the uh, seat me- uh, Navy Seals and the attack on uh, his compound because of where they knew where he was. And uh, it also goes through somehow har- the hardships that went through with getting that done. And it goes through the e- to the end um, and this was a very important documentary, uh, about this killing. Uh, very sobering reminder of uh, of..."}, {"type": "line", "person": "Gregg", "line": "Well it's not really a documentary. It's uh, they're using actors and- I liked the movie a lot. It was a popcorn movie, but it's history. This film is history, and reliving the history so soon after it actually happened was uh, kind of a thrill, quite honestly-"}, {"type": "line", "person": "Tim", "line": "Yeah, we've seen this in other documentaries where they make a documentary about um, for example-"}, {"type": "line", "person": "Gregg", "line": "Wasn't really a documentary, it was more of a dramatization."}, {"type": "line", "person": "Tim", "line": "Mhm. Same thing."}, {"type": "line", "person": "Gregg", "line": "Well, it's a little different, but it's a- it's a great film either way and uh, the guy who played Osama Bin Laden was very convincing."}, {"type": "line", "person": "Tim", "line": "And everyone knew that they were gonna nail this guy, Osama Bin Laden, this... pig. And finally at the end it comes, and, though you know it's coming, it's still a great surprise and everybody in the a- the audience that I was with cheered for joy."}, {"type": "line", "person": "Gregg", "line": "Yeah, I mean, it's a good film, um, definitely brings back some memories, some good some bad. I would have liked to have seen, if I have any complaint, would've liked to have seen more about Osama Bin Laden's life before all this stuff happened, sort of what- how he filled his days and that sort of thing, and they didn't really get into that. So that's one flaw of the film."}, {"type": "line", "person": "Tim", "line": "Right, well, lot of great acting going on in this. Uh, Chris Pratt, Jessica Chastin, Joel S- Eggerston."}, {"type": "line", "person": "Gregg", "line": "These are no-name actors, it's a l- a cheaper sort of movie. They couldn't afford to pay Harrison Ford, or a Mel Gibson, or something like that-"}, {"type": "line", "person": "Tim", "line": "You know it's interesting, I was watching The Dictator, the S- great Sasha Baron Cohen movie-"}, {"type": "line", "person": "Gregg", "line": "Classic."}, {"type": "line", "person": "Tim", "line": "and um, I thought to myself, ooh, wouldn't it've been an interesting casting choice to cast Sasha Baron Cohen as Osama Bin Laden?"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "And that could've been kind of a very- in the same way that you might cast somebody like Bill Murray, like we saw him playing rew-sevelt-"}, {"type": "line", "person": "Gregg", "line": "I would not cast Bill Murray as Osama Bin Laden."}, {"type": "line", "person": "Tim", "line": "Oh, no, I'm saying we cast- I'm not saying we cast Bill Murray as Osama Bin Laden, I'm saying Sasha Baron Cohen has Indian-looking features-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "Might be more appropriate for playing that kind of part. Uh, and it would've been- he could've gotten uh, that sort of perfect mix of humor and tragedy, which makes for great movies."}, {"type": "line", "person": "Gregg", "line": "And he might've included more scenes about Osama Bin Laden's life before he was murdered, which is what interested me about the movie, and which they didn't really cover."}, {"type": "line", "person": "Tim", "line": "Great movie nonetheless, desin- definitely an Oscer contender in my book. I'm giving it-"}, {"type": "line", "person": "Gregg", "line": "Not the bigger Oscers. I mean, that was- it's gonna go to The Hobbit. This would be best sound or costumes, and things like that."}, {"type": "line", "person": "Tim", "line": "Well, not costumes, it's just a bunch of rags and camouflage that you can get at Army Navy store-"}, {"type": "line", "person": "Gregg", "line": "Yeah, but the gu- eh- myea, okay, whatever."}, {"type": "line", "person": "Tim", "line": "Three stars."}, {"type": "line", "person": "Gregg", "line": "Yeah, I'd give it... four stars."}, {"type": "line", "person": "Tim", "line": "Like a four star general probably had something to do with the- the operation-"}, {"type": "line", "person": "Gregg", "line": "Or- you know what, uh f- I'm- I'm giving it four bags of popcorn."}, {"type": "line", "person": "Tim", "line": "... th- three bags of popcorn from me. And uh, so changing gears, just to touch here , we got the second movie we're gonna discuss today, called Monsters I N C i- 3D. Rerelease of original 3- Rerelease in dr- uh, of 3D. In original 3D. We usually don't do rereleases, but this is a big one, folks. Some people said to me, oh no, are they gonna re-cast the voices, but-"}, {"type": "line", "person": "Gregg", "line": "Mmm."}, {"type": "line", "person": "Tim", "line": "no they haven't. Jim- uh, Billy Crystal and John Goodman are still in this movie, they're fantastic in it, uh, and so that's a big sigh of relief from a lot of people I know. It's great for kids, but it's also great for old folks, and everybody in between. Your thoughts on this one? I loved it."}, {"type": "line", "person": "Gregg", "line": "Osama Bin Laden, that film should be called Monsters Inc. 'Cause he was- it-"}, {"type": "line", "person": "Tim", "line": "Oh, Monsters Inc."}, {"type": "line", "person": "Gregg", "line": "total monster. Um, but, no, this is something different. This is, of course, the old Monsters Inc. We've seen it a million times, seen it on TV. Uh, no reason, really, to go to the theater but uh-"}, {"type": "line", "person": "Tim", "line": "See, I think you're wrong there. I think it is important to go see this movie o- on 3- see it on theaters, so go check out Monsters Inc. I'm giving it three stars, three corns."}, {"type": "line", "person": "Gregg", "line": "I loved the movie. I'm gonna give it five, uh, buckets of popcorn. But watch it on video."}, {"type": "line", "person": "Tim", "line": "You're crazy. You're wasting your time if you're sitting at home watching this on your shitty TV."}, {"type": "line", "person": "Gregg", "line": "The theater that I went to, the 3D was not working properly, and with the parking- cost of parking these days, it's not validated-"}, {"type": "line", "person": "Tim", "line": "Money's no object when it comes to great entertainment-"}, {"type": "line", "person": "Gregg", "line": "I'd just as soon stay at home, and I loved the movie, I g- I loved this movie, I- it's one of my all time favorites, but I think you're better off buying it. You can buy it on uh, uh, Ebay. Place a bid and see what happens. You might get lucky."}, {"type": "line", "person": "Tim", "line": "No, well worth the money to go see this live. Uh, with a bunch of friends. And also see with a gr- a great crowd, go see it on a Friday night-"}, {"type": "line", "person": "Gregg", "line": "Well you can see it with friends come over to your house too, and see the movie."}, {"type": "line", "person": "Tim", "line": "<sighs>"}, {"type": "line", "person": "Gregg", "line": "You don't always have to go somewhere with your friends, with the gas prices-"}, {"type": "line", "person": "Tim", "line": "Tell you what, if you wanna-"}, {"type": "line", "person": "Gregg", "line": "That's why Osama Bin Laden, one of the things that made that movie interesting, was you have the gas crisis and we're tired of the gas prices. How 'bout you save a few dollars, have the neighborhood kids come over, if you don't have kids yourself-"}, {"type": "line", "person": "Tim", "line": "Tell you what-"}, {"type": "line", "person": "Gregg", "line": "and i- it's a lot of fun."}, {"type": "line", "person": "Tim", "line": "Alright, well what- I give it uh, five and two. So what are you giving it?"}, {"type": "line", "person": "Gregg", "line": "Five microwaved bags of popcorn and two t- two litre bottles of Coke-"}, {"type": "line", "person": "Tim", "line": "Ok, you got- alr- alright, well we're gonna have to disagree on that."}, {"type": "line", "person": "Gregg", "line": "with some cups and you pour it for every kid in the neighborhood, and they can all come over and watch the movie. Everyone saves mo-"}, {"type": "line", "person": "Tim", "line": "We're gonna have to dd- ok, we agree to disagree, but I think we both agree, go see Monsters Inc. in the theaters this weekend. Uh-"}, {"type": "line", "person": "Gregg", "line": "Or at home, uh, on your home theater system."}, {"type": "line", "person": "Tim", "line": "Alright... Uh, we're gonna cut to another episode of Gregg Turkington's On Cinema: On Location. Show that."}, {"type": "stage_direction", "stage_direction": "On Cinema: On Location Intro"}, {"type": "line", "person": "Gregg", "line": "Welcome to a sad, somber edition of On Cinema: On Location. This edition is in memory of Bela Lugosi, the great horror actor from the ninteen thirties, forties, and fifties. You may have seen him loved in movies like Dracula and The Mummy. And we're here, right now, at the apartment where Mister Lugosi passed away one sad, gloomy day, uh, many, many years ago. Bela Lugosi, the great Bela Lugosi died right here. Piece of Hollywood history for you. Back to you, Tim."}, {"type": "line", "person": "Tim", "line": "Thanks for that."}, {"type": "line", "person": "Gregg", "line": "Yeah, my pleasure."}, {"type": "line", "person": "Tim", "line": "Uh, holidays are coming up, so we got some holiday movies coming next week, and uh, until then, uh Zero Dark Thirty gets..."}, {"type": "line", "person": "Gregg", "line": "Three bags of popcorn each."}, {"type": "line", "person": "Tim", "line": "I get three bags of popcorn for that, and Monsters I N- Monsters Inc. 3D gets five bags of popcorn from me."}, {"type": "line", "person": "Gregg", "line": "And from me too, but, again, uh, stay home and watch it."}, {"type": "line", "person": "Tim", "line": "Check that out in the movie theater this week. Alright, well guys, thanks again for watching, and enjoy the film!"}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "[...]"}, {"type": "line", "person": "Gregg", "line": "I got-"}, {"type": "line", "person": "Tim", "line": "Deleted scenes-"}, {"type": "line", "person": "Gregg", "line": "I gotta nice plasma TV. I don't need to go to the theater to watch it-"}, {"type": "line", "person": "Tim", "line": "There's deleted scenes-"}, {"type": "line", "person": "Gregg", "line": "They're probably showing it off the DVD anyway."}, {"type": "line", "person": "Tim", "line": "Alright, get outta here"}], "name": "S01E08"}