{"transcript": [{"type": "line", "person": "Tim", "line": "These are great movies! When you got movies like Tom Cruise in them, you can't lose! 6 Bags of popcorn, two sodas. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker and welcome to my show webshow called On Cinema at the Cinema. It is the first kind of show where we can take a look at movies coming out this weekend and give you guys advice about what to see, what to stay away from, maybe even movies that you should just wait to see on VHS or- or on video. Or uh... On demand. Uh, my guest is uh, one of uh, a guy who I've known for a while now, he's back uh, he's on our first episode and uh, he knows quite a bit about movies, he's a film buff, Mister Gregg Turkington. Gregg, thanks for coming on the show"}, {"type": "line", "person": "Gregg", "line": "Tck Hey guys, good to be back in my seat again"}, {"type": "line", "person": "Tim", "line": "Hehe, the seat is for anybody who's a guest of the show, so"}, {"type": "line", "person": "Gregg", "line": "Well, I mean s-"}, {"type": "line", "person": "Tim", "line": "Our first movie is called Skyfall, and it's about uh, James Bond who goes to test his loyalty, starring gring-ding- uh, Daniel Craig. Uh, and it's another example of Bond doing what he does, spying and whatnot. Uh, I know you're a bondhead."}, {"type": "line", "person": "Gregg", "line": "I'm a bondfreak and seeing Skyfall is why we do what we do, is to have the chance to see movies like this, and enjoy them, and no one enjoys James Bond more than I do. I mean, any time you have a chance to see a James Bond film, you've gotta see it. They're all great movies. There has not been a James Bond movie that's not a ten out of ten. This one is no exception. I really loved it. I really loved it and think it's right up there with the best of the best."}, {"type": "line", "person": "Tim", "line": "Alright, well, so Skyfall em, I wasn't as nuts about it. It's still a great movie, I give it four tubs of popcorn and just four tubs of popcorn 'cause it's a good- lotta good action sequences. I'm not a really big fan of the Bond movies myself but-"}, {"type": "line", "person": "Gregg", "line": "Why not?"}, {"type": "line", "person": "Tim", "line": "Uh I... I just don't like- I'd rather watch other movies, I'd rather watch a Spie- uh, Steven Spielberg movies, which I'm getting to next. Anyway, uh, was a great movie, though, and I'll give it five bags of popcorn. Gregg?"}, {"type": "line", "person": "Gregg", "line": "I'm gonna give it fi- well five is the most we can give, so I'm gonna give it five bags of popcorn, but I'm gonna pack 'em tight with as much corn as I can get in there, and a extra ladle of butter because I love this movie. It's right up there with the best of Bond."}, {"type": "line", "person": "Tim", "line": "...Alright. You could also add sodas if you want."}, {"type": "line", "person": "Gregg", "line": "Alright, then I'll add a hundred sodas."}, {"type": "line", "person": "Tim", "line": "Alright, well our next movie I was very excited about all summer long because return of my favorite director, Steven Spielberg, with Lincoln, story about Abe- President Abraham Lincoln. And it's got everybody in it. Daniel Day Lewis and Dang- g- uh Joseph Gordon-Levitt, and Tommy Lee Jones, and a number of other people. This movie is about Abe Lincoln and it's about Civil War and it's one of the great movies of all time in my opinion. Could you believe all the amazing things, all the history that's in this movie and the great job that Daniel Day Lewis Does? This movie just doesn't stop giving back. It really made you feel like you're back in the civil war times. Uh, what'd you think, Gregg?"}, {"type": "line", "person": "Gregg", "line": "Uh, I've seen a lot of movies about Lincoln, this was one of the best! Uh, Steven Spielberg has come through once again. If you liked E.T. this is a different sort of film, it's more in line with a historical drama. I've always loved Steven Spielberg, I've always admired Abraham Lincoln. Uh, it's a good film, maybe even a great film, not as good as the James Bond film, if you could only see one movie out of the two, make it the Bond film."}, {"type": "line", "person": "Tim", "line": "Great, well uh, I'm giving it uh, as many bags of popcorn as you can, which is six bags of popcorn and three sodas."}, {"type": "line", "person": "Gregg", "line": "I'm gonna give it five uh, well no, I'm gonna give it four 'cause I gave the bond five and I prefer that. I'll give this four, but I'm gonna throw in a roll of Lincoln pennies."}, {"type": "line", "person": "Tim", "line": "Alright, so check out these two movies, we both recommend them for different reasons. Uh, if you're not planning on going to the movies this weekend, we recommend uh, it's a segment we did last week that was very successful. Gregg's agreed to bring in uh, a VHS tape from his library and uh, let's take a look at this weeks uh, popcorn classic. So, let's take a look at this week's popcorn classic."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics Theme"}, {"type": "line", "person": "Gregg", "line": "This week on my popcorn classic segment, we're looking at Murphy's Romance, starring James Garner and Sally Field, two great actors, er, actor and actresses, er, an actor and an actress in the prime of their career. She's Murphy. Uh, not sure what his character is called. The film doesn't really work. The- there's no chemistry, the age difference was just a little too vast. So-"}, {"type": "line", "person": "Tim", "line": "Yeah, I don't- I remember seeing this many years ago. Not really that- my kind of film, but uh, if you're into romantic comedies, I guess this would be a movie f- uh, you want to check it out."}, {"type": "line", "person": "Gregg", "line": "It's uh, it's, you know what, it's one of those ones you see time and time again if you haunt the dollar bins ah, so pick it up, give it a chance."}, {"type": "line", "person": "Tim", "line": "Alright, I- it reminds me of the old saying Murphy's law which says that anything good happens- anything bad happens will. Uh-"}, {"type": "line", "person": "Gregg", "line": "And that's funny because I bought this film and I went home to play it and the tape was all messed up and it took two years 'til I found another copy. And when I did, I didn't really like it much. So that is kinda Murphy's law."}, {"type": "line", "person": "Tim", "line": "Hm. Interesting. Uh, interesting that you'd bring that in if you didn't like it. Anyhow, thank you very much. Once again, Skyfall's getting four bags of popcorn from me and Lincoln is getting six bags with two sodas."}, {"type": "line", "person": "Gregg", "line": "Well, I thought it only went up to five, so, but if it is five for the Bond and three for Lincoln, and it should only be five for Lincoln for you 'cause it doesn't go up to six."}, {"type": "line", "person": "Tim", "line": "Six bags and uh, we- it does go up to six. Thank you guys-"}, {"type": "line", "person": "Gregg", "line": "Alright, then six for the Bond."}, {"type": "line", "person": "Tim", "line": "Well, so either case, great movies, great weekend to go see movies, so please make sure you go see at least one or two of these movies this weekend. Thanks again for watching, and thanks Gregg for being the guest. Thanks al- again for watching-"}, {"type": "line", "person": "Gregg", "line": "Thank you."}, {"type": "line", "person": "Tim", "line": "And s- and uh, have a great day, and enjoy the movie"}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "[...]"}], "name": "S01E02"}