{"transcript": [{"type": "line", "person": "Tim", "line": "Should I see a movie this weekend? Aaaaaah! This is as good as a movie can get, and it's so great that they're still making these kinds of movies. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody. My name is Tim Heidecker. You're watching On Cinema at the Cinema, the webisodes that talk about what movies are coming out this weekend, and hopefully give you some advice as whether or not you should see these movies coming up- some of these movies, you should skip 'cause they're junk. Uh, my guest is Gregg Turkington."}, {"type": "line", "person": "Gregg", "line": "Hey guys. Um, good to be here, and to be part of the On Cinema Family. And celebrating another successful episode."}, {"type": "line", "person": "Tim", "line": "Yeah, and thank everybody for uh, or thanks to everybody for their support, and enjoying these episodes. And uh, we've got a lotta people thanking us for recommending s- The Hobbit. People are nuts about that movie."}, {"type": "line", "person": "Gregg", "line": "And it's been a big hit."}, {"type": "line", "person": "Tim", "line": "Yeah, and congratulations to Peter Jackson, the king of movies. Um, our movie today is called Jack Reacher. Uh, directed by Christopher McQuarrie, starring Tom Cruise."}, {"type": "line", "person": "Gregg", "line": "Mmm."}, {"type": "line", "person": "Tim", "line": "And I'm so glad to see Tom Cruise back in the mix. Last year he destroyed it with um, Mission Impossible 5. And it was such a fun movie, and I loved that movie so much. So good- good for him. This movie is about a homicide detective who digs deeper into the case of a trained military sniper who shot five random... victim- that sounds pretty good."}, {"type": "line", "person": "Gregg", "line": "It's an instant classic, and it's good to see Tom Cruise back in the news, not for some of the strange things that he's invo- been involved in, but for what he's best at, which is dodging bullets and dealing with runaway trains, rather than in the scandal sheets where we've seen a lot of him these past few years-"}, {"type": "line", "person": "Tim", "line": "Well..."}, {"type": "line", "person": "Gregg", "line": "and that's not fair 'cause he's a fine actor, and uh, has a lot to offer-"}, {"type": "line", "person": "Tim", "line": "He's definitely in my top three actors-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "You know, when it comes to people I love to see, I love Robert DeNiro, I love the director Steven Spielberg, and I love Tom Cruise. So I'm giving that one the highest score you can give it, which is six bags of popcorn and six sodas. And uh, Gregg?"}, {"type": "line", "person": "Gregg", "line": "I'm gonna have to say five is the highest- that's- at least for me, that's the highest you can give. And I would skip the sodas. It's- It's a good movie, but stick with the five- It's-"}, {"type": "line", "person": "Tim", "line": "Definitely a popcorn"}, {"type": "line", "person": "Tim and Gregg", "line": "Definitely a popcorn movie."}, {"type": "line", "person": "Tim", "line": "Alright, well we got Cirque du Soleil: Worlds Away. If anybody does not familiar with Cirque du Soleil, then you sh- should look it up online because it really is about a circus, on ropes and with uh, a tightrope, and uh, clowns, and the things that you'd see at a circus, but even better than a circus. Uh, this is very much like going to see Cirque du Soleil, except it's been filmed and shot, and you can watch it as a movie. I loved it."}, {"type": "line", "person": "Gregg", "line": "Yeah, I loved it too. If you can't get to Las Vegas, I mean if you're lucky, you can, 'cause it's a fun city, but if you can't get out there to see Cirque du Soleil in person, uh, go to your local Cineplex, or your local drive in, or uh, just your local theater, and see this movie, it would be great on IMAX. It's also um, probably on the regular screens too."}, {"type": "line", "person": "Tim", "line": "So I'm giving Cirque du Soleil five stars and uh, five uh, bags of popcorn- four bags of popcorn. And uh, because it- it- there- it is a bit long, and uh, kt- a- also some of it's in French."}, {"type": "line", "person": "Gregg", "line": "I'd have it four bags of popcorn. If you like juggling and ropes and uh, the life of the circus performer, I can't recommend it enough. I give it five bags of popcorn."}, {"type": "line", "person": "Tim", "line": "Wow-"}, {"type": "line", "person": "Gregg", "line": "And a cotton candy."}, {"type": "line", "person": "Tim", "line": "Alright, so let's move on. If you are gonna stay home and watch movies at home, then we recommend this, it's one of our popcorn classics."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics Theme"}, {"type": "line", "person": "Gregg", "line": "Uh, today on my segment, Popcorn Classics, we have... Dick Tracy, starring Warren Beatty-"}, {"type": "line", "person": "Tim", "line": "Oh, well I actually have a movie instead, that I wanted just to surprise you with. This is a little surprise on your end. This time I brought in a movie-"}, {"type": "line", "person": "Gregg", "line": "Alright, ok."}, {"type": "line", "person": "Tim", "line": "Put- put Dick Tracy away. Put the dick back in your pants."}, {"type": "line", "person": "Tim and Gregg", "line": "<laugh>"}, {"type": "line", "person": "Tim", "line": "Uh... can we use that? ...I don't know if we can get away with that. Uh, I've brought in Star Trek IV. Um, if anyone listens to the podcast, they'll know that there's been a big disagreement between Gregg and I on the plot of Star Trek II: Wrath of Khan. Gregg seems to insist that Star Trek II is where they go back to San Francisco-"}, {"type": "line", "person": "Gregg", "line": "Yeah."}, {"type": "line", "person": "Tim", "line": "But what's true-"}, {"type": "line", "person": "Gregg", "line": "That's right."}, {"type": "line", "person": "Tim", "line": "is- is Star Trek IV is o- the one where, uh, they go back to San Francisco for l- listen to this. Kirk and his crew must travel- must time travel back to nineteen eighty six-"}, {"type": "line", "person": "Gregg", "line": "You reading off the card or off the box?"}, {"type": "line", "person": "Tim", "line": "No, I'm wor- I'm reading off the box. <sighs> Crew must Kirk- Kirk must k- true- crew- Kirk and his crew must time travel back to nineteen eighty six San Francisco, where they find a world of punk, pizza, and exact change buses that are as alien as anything they've ever encountered in the far reaches the galaxy. That's the plot of Star Trek IV. Argument over, argument settled. I have been proven correct once again."}, {"type": "line", "person": "Gregg", "line": "No, Star Trek II: The Wrath of Khan is where they go to San Francisco. The Voyage Home, they go back into Space. That's where their home is. That's the voyage home."}, {"type": "line", "person": "Tim", "line": "No, they're from Earth! They have- that's where they're going back to Earth, The Voyage Home."}, {"type": "line", "person": "Gregg", "line": "I don't think Spock is from Earth. I don't think he's seen anything like that on Earth. And Star Trek IV-"}, {"type": "line", "person": "Tim", "line": "Guys, if you guys know the answer to this, I-"}, {"type": "line", "person": "Gregg", "line": "This is not the artwork from Star Trek IV. That's- this is not real- there's no hologram. You see, that's how you tell a pirated video-"}, {"type": "line", "person": "Tim", "line": "This is the original-"}, {"type": "line", "person": "Gregg", "line": "If you look at a legitimate video, like the Dick Tracy video... Oh, this is a pirated video too. Oh, no it's- see? Here's the security seal."}, {"type": "line", "person": "Tim", "line": "<sighs>"}, {"type": "line", "person": "Gregg", "line": "There's no security seal."}, {"type": "line", "person": "Tim", "line": "Well, there is a security seal, it says seven one seven nine seven right underneath the Paramount Symbol-"}, {"type": "line", "person": "Gregg", "line": "That's called the catalog number, so it doesn't mean anything. Anyways, Star Trek II: The Wrath of Khan is a great movie. I don't know what's on that tape. It's probably S- Star Wars 2 because it's a pirate- you probably got it in Malaysia or something. That's not something that they would sell, uh, at a real store here, because you go to jail for piracy, and you should. And Dick Tracy with Warren Beatty is also a film that we recommend."}, {"type": "line", "person": "Tim", "line": "A- audience, would you call and write to this gu- this nut here and tell him that Star Trek IV, if you just watch it, is them going back- it says here right in the movie, it says th- i- on the credit title sequence says Star Trek IV, and then they go back to San Francisco, it's not that hard to explain. Star Trek II: The Wrath of Khan was r-"}, {"type": "line", "person": "Gregg", "line": "Well, it's not too hard to splice something like- Star Trek II, which was the second movie after Star Trek: The Motion Picture, they go back to San Francisco."}, {"type": "line", "person": "Tim", "line": "Star Trek IV is about San Francisco. Thank you guys very much, and we'll see you next week, and-"}, {"type": "line", "person": "Gregg", "line": "Star Trek II, they go to San Francisco. Star Trek IV, they go home, into space, where they came from-"}, {"type": "line", "person": "Tim", "line": "Okay, well, you're wrong, I'm right. Thanks, and enjoy the film-"}, {"type": "line", "person": "Gregg", "line": "He's not from San Francisco-"}, {"type": "line", "person": "Tim", "line": "Enjoy the film!"}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "[...] right here."}, {"type": "line", "person": "Gregg", "line": "There's no hologram. [...] Dick Tracey."}, {"type": "line", "person": "Tim", "line": "It doesn't matter! It doesn't matter. This is- Do you think I'm making this up?"}, {"type": "line", "person": "Gregg", "line": "Yeah."}, {"type": "line", "person": "Tim", "line": "Why? Why would I care?"}, {"type": "line", "person": "Gregg", "line": "The box is falling apart. It's obviously not a real box."}], "name": "S01E09"}