{"transcript": [{"type": "line", "person": "Tim", "line": "I love this movie! I'm Tim Heidecker and you're watching On Cinema at the Cinema. Quiet on set!"}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker and you're watching another episode of On Cinema at the Cinema. It's a webseries, uh, here on this website where we talk about uh, what movies are coming to your theaters soon, and uh it's- it's a wonderful way to find out uh, different opinions of films. Um, very excited to have a guest with me today. He is one of the experts on film, and his name is Gregg Turkington. Thanks for coming on the show."}, {"type": "line", "person": "Gregg", "line": "Hey guys! Good to be back, uh, with the On Cinema family-"}, {"type": "line", "person": "Tim", "line": "Yes. And uh, it's been uh, first ten were very successful and we appreciate all the kind words everyone said, and uh, we hope to be doing this for a long, long time. So uh-"}, {"type": "line", "person": "Gregg", "line": "And thanks to all the cards and letters for people uh, asking to sort of, increase my appearances on the show."}, {"type": "line", "person": "Tim", "line": "Well... I think you're well-represented on the show... Thank you very much. Our films today are Side Effects with Steven Soda- uh, I was gonna say Steve Martin. Steve Sodebergh-"}, {"type": "line", "person": "Gregg", "line": "I'll be talking about Steve Martin a little bit later today."}, {"type": "line", "person": "Tim", "line": "Okay... Steven Sodebergh directed Channing Tatum and Roning Mar- Rooney M- Rooney Mara..."}, {"type": "line", "person": "Gregg", "line": "Mickey Rooney? No."}, {"type": "line", "person": "Tim", "line": "No, it's Rooney Mara."}, {"type": "line", "person": "Gregg", "line": "What is it? Rooney M- yeah, okay."}, {"type": "line", "person": "Tim", "line": "It's two names. Mar- oh-"}, {"type": "line", "person": "Gregg", "line": "Never seen that before-"}, {"type": "line", "person": "Tim", "line": "Mar- it's uh, Mara Rooney. And, uh, Judd Law. Jude Law. From Jude, uh-"}, {"type": "line", "person": "Gregg", "line": "The great Jude Law!"}, {"type": "line", "person": "Tim", "line": "Right, from Jude Law. And uh, he stars in, uh, this movie, which is a prescription medication story about a woman who abuses drugs, the prescription kind, not coke and grass. Uh, Channing Tatum is in this movie, and that's why I went to go see it, that's why I loved it. Um, what did you think?"}, {"type": "line", "person": "Gregg", "line": "I thought it was a frightening movie. It's sort of a modern day One Flew Over the Cuckoo's Nest. You, um, can learn a lot from this, but it also kinda scares you to see that people can sink this low-"}, {"type": "line", "person": "Tim", "line": "Yeah, um, uh- it- it sorta had uh- r- it resonated with me on a personal level. Um-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "Some kind of breaking news in my land: Uh, this week, I was diagnosed with having several blood clots on my brain and uh, it's one of those things where do you operate or not? I-"}, {"type": "line", "person": "Gregg", "line": "No, you get the operation... You gotta get the operation."}, {"type": "line", "person": "Tim", "line": "Well. I mean th- obviously that's one of the choices we have to make. Uh it-"}, {"type": "line", "person": "Gregg", "line": "Why would you choose not to get- to get a tumor removed?"}, {"type": "line", "person": "Tim", "line": "It's a long story, but the doctor's telling me that that's not necessarily the only option, that we could wait it out, see what happens, and-"}, {"type": "line", "person": "Gregg", "line": "Get another doctor. 'Cause that's dangerous-"}, {"type": "line", "person": "Tim", "line": "You don't have to have operation."}, {"type": "line", "person": "Gregg", "line": "Well..."}, {"type": "line", "person": "Tim", "line": "There's a chance that nothing will happen. So-"}, {"type": "line", "person": "Gregg", "line": "That's a bad doctor."}, {"type": "line", "person": "Tim", "line": "Alright. Um, but my point is that side-effects and the whole idea of the medical industry and drugs and Obamacare and everything like that, uh, this movie hit home. I give it six bags of popcorn. And a two bags- uh, two sodas because it is a classic. It's one of the great American movies of all time."}, {"type": "line", "person": "Gregg", "line": "Well, I don't have a- a tumor an- but I- loved the movie. I think the scale only goes up to five. I'm gonna give it all five bags of popcorn and I'm gonna throw in a get well card for you, uh, and hope that you do choose uh, to get this tumor removed."}, {"type": "line", "person": "Tim", "line": "Well, okay. None of your business. Our next film that we're discussing is a- on the lighter side of th- uh, or n- on- from the lighter side is a comedy, is Identity Theft. Thief. Identity Thief. This is a mild-mannered businessman discovers his identity's been stolen, hits the roa- uh, he hits the road. In an attempt to stop the thief. Starring G- Seth Gor- Seth Green. No Seth Gire- Director Seth Gordon. Commissioner Gordon. And uh, starring, uh, Jason Batman, the uh, Melissa McCarthy, who we all know. And John Faver- F- Mm. John Favereau. Favreau."}, {"type": "line", "person": "Gregg", "line": "Favereau- Favreau."}, {"type": "line", "person": "Tim", "line": "Who's a director. Um. inter- okay. Maybe you guys messed the card up. He should be um, here as director. So we've all been down this road before. We've gotten our identity stolen and, uh, this is a very funny movie. Eh, you know, it's got Meliss- Melissa McCarthy, who's one of the original funny ladies of cinema right now, and uh-"}, {"type": "line", "person": "Gregg", "line": "Yeah, and they might- she might be stealing people's identity, but what she's really stealing is our heart, and she's done that in the last few movies she's been in and I loved this movie-"}, {"type": "line", "person": "Tim", "line": "She almost reminds me of a modern day Lucille Ball, you know, in that sort of sense of being a comedian. Um, funny ladies, Goldie Hawn, uh, woman comedy star Gilda Radner, some-"}, {"type": "line", "person": "Gregg", "line": "But there's no one really like Dezi Arnaz, he was sort of the best. But I still found that I laughed all the way through, so I'm gonna give it five bags of popcorn and some of those lil' chattering teeth."}, {"type": "line", "person": "Tim", "line": "Well uh, thank you very much for that, and uh, I'll give it four bags of popcorn because uh, I thought, uh, that there were moments that bored- bored uh, were boring. And uh, almost put me to sleep. But um, I was also having a hard time paying attention. Uh, but a lot of funny scenes too-"}, {"type": "line", "person": "Gregg", "line": "It's a great movie, and I think it's something that they'll be talking about throughout the year-"}, {"type": "line", "person": "Tim", "line": "Okay, so uh, finally today, we're gonna do our Popcorn Classic, this is a segment where b- Gregg brings in a movie of- from his home library. If you don't wanna go out to the movie theaters and pay- pay the babysitter and, uh, and do that whole jazz, where you just uh, end up spending a fortune to go out to the dumb movies."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics Theme"}, {"type": "line", "person": "Gregg", "line": "Yes, this is my segment, where we... discuss movies that you might've missed, that come from my personal uh, collection of movies. Uh, this week, uh, we've got Steve Martin in A Simple Twist of Fate, which uh, he's made a lot of great movies, this isn't one of 'em. It's a good movie, and it's worth seeing just to see what it's like for Steve Martin when he's not excelling in a role."}, {"type": "line", "person": "Tim", "line": "It'll definitely fill the- fill the couple hours that it takes to watch the movie."}, {"type": "line", "person": "Gregg", "line": "It's just strange when you're watching it, to realize like, this is Steve Martin, that we love in Parenthood and movies like that and, what's he doing in this? But, that makes it interesting. It gives it kind of an edge, and uh, I recommend it. I mean, if you've got nothin' better to do. Uh, and if you are trying to build a collection, this one you can get very cheap. Uh, I got this one I think for a quarter, so. It's a good way, if you're a new collector, to sort of start stockpiling those films."}, {"type": "line", "person": "Tim", "line": "Where would you rate this in the sit 'n l- if you had a list of Steve Martin films, in terms of-"}, {"type": "line", "person": "Gregg", "line": "Top ten. And I just wanted to correct what I said. I'd guess I payed a dollar twenty two. Not a quarter, 'cause it s- says a dollar twenty two-"}, {"type": "line", "person": "Tim", "line": "Doesn't matter. Uh, that's our show. Uh, Side Effects got six bags of popcorn, two sodas from me. And Greg gave it-"}, {"type": "line", "person": "Gregg", "line": "I gave it five bags of popcorn, and a get well card 'cause we're all... scared, here at On Cinema, about uh, your tumor."}, {"type": "line", "person": "Tim", "line": "It's not a tumor. It's nah a tumah, as Ahnold Schwarzenegger would say. Uh, it's uh, several blood clots. That doesn't necessarily have to be operated on. So we're-"}, {"type": "line", "person": "Gregg", "line": "Well, it should."}, {"type": "line", "person": "Tim", "line": "Alright. And The Identity Thief. Uh, must see movie of the week."}, {"type": "line", "person": "Gregg", "line": "And I gave it five bags of popcorn and she's quite a thief in the movie, I love this movie-"}, {"type": "line", "person": "Tim", "line": "<chuckles> Thank you guys for watching."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "[...] reason we can't"}, {"type": "line", "person": "Gregg", "line": "[...] See a better doctor. Sounds like you're going to a vet."}], "name": "S02E01"}