{"transcript": [{"type": "line", "person": "Tim", "line": "These are great movies! Ah man, this movie had it all. It had action, drama, comedy, suspense, and dance. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker, and I'm the host of On Cinema at the Cinema. Thanks for watching, and it is a show about movies, and reviews of movies, and my name is- Oh. Uh, my guest is, uh, Gregg Turkington."}, {"type": "line", "person": "Gregg", "line": "Hey guys, good to be here on another uh, edition of On Cinema-"}, {"type": "line", "person": "Tim", "line": "Put your hand down. Well our movies today is The uh, Oz the Great and Powerful, directed by Sam Raimi, and it stars James Franco as Oz, and Meelin Kuris- uh, Mila Kuris, and Michelle Williams, who's very uh, good-looking, and, as a woman, as a... that's- you know."}, {"type": "line", "person": "Gregg", "line": "It's not really what the movie's about, though. This is a sequel to The Wizard of Oz, which, if you're-"}, {"type": "line", "person": "Tim", "line": "Prequel to The Wizard of Oz. Um, in which we find out how Oz became so great and powerful-"}, {"type": "line", "person": "Gregg", "line": "And I would say it's about time because uh, those of us who are Oz-freaks have been waiting since nineteen thirty-nine, which is when the last Wizard of Oz movie came out. It was an MGM, uh, picture, starring Judy Garland."}, {"type": "line", "person": "Tim", "line": "Ah."}, {"type": "line", "person": "Gregg", "line": "And to wait this long to find out the next chapter is uh, kind of a burden a lot of people have passed on who saw the original and never got a chance to see the next chapter, and so that's kind of a shame, and as much as I love this movie, and I do love it, and I- just to preview, I will be giving it five bags of popcorn. Um, I missed the Munchkins. I gotta say, I missed the Munchkins. I never thought, uh, I would hear myself say that."}, {"type": "line", "person": "Tim", "line": "<chuckles>"}, {"type": "line", "person": "Gregg", "line": "And I know a lot of them, again, have passed away, because they waited too long, but uh, there is still one of the original Munchkins is still alive and he's going around the country and signing autographs and things, and to not include him in this movie, uh, after he's been an ambassador for Oz all these years, is kind of a slap in the face."}, {"type": "line", "person": "Tim", "line": "Well, I wonder if he went to the premiere."}, {"type": "line", "person": "Gregg", "line": "I bet they didn't even give him an invitation."}, {"type": "line", "person": "Tim", "line": "Mmm."}, {"type": "line", "person": "Gregg", "line": "Toto too. That's another character that I loved. His little dog, Toto-"}, {"type": "line", "person": "Tim", "line": "Great."}, {"type": "line", "person": "Gregg", "line": "and um-"}, {"type": "line", "person": "Tim", "line": "I love it, from the original Wizard of Oz, one of the greatest, probably the most quotable lines in all of movie is..."}, {"type": "line", "person": "Gregg", "line": "Uh, we're not in Kansas anymore, yeah-"}, {"type": "line", "person": "Tim", "line": "We're not in Kansas anymore, Toto"}, {"type": "line", "person": "Gregg", "line": "And they're not in Kansas in this movie, and I think that's kind of a flaw in the movie-"}, {"type": "line", "person": "Tim", "line": "Right, and I always liked to use that expression when, for example, there's something strange going on, or we're in a strange situation. Uh, you know, we had a- had a flight recently to uh, Phoenix, and uh, it was delayed, and it was no exp- the people were doing a terrible job of explaining what the delay was, and I turned to my wife, and I said, we're not in Kansas anymore, Toto."}, {"type": "line", "person": "Gregg", "line": "Well if the plane originated in Kansas, that would- I mean, that would be- that would make sense-"}, {"type": "line", "person": "Tim", "line": "Right on-the-n- might be too on-the-nose"}, {"type": "line", "person": "Gregg", "line": "Mmm."}, {"type": "line", "person": "Tim", "line": "Well, I still loved this movie, despite the- despite this film being Munchin-less. I'm giving it four bags of popcorn-"}, {"type": "line", "person": "Gregg", "line": "And Toto-less too."}, {"type": "line", "person": "Tim", "line": "Mhm. Don't go to the theater expecting Toto. Uh, but still, four bags of popcorn. They lost a full bag of popcorn from me because of no Munchkins."}, {"type": "line", "person": "Gregg", "line": "I'm gonna say... zero bags of popcorn because I'm gonna say, let's take Toto's lil' basket and fill that with popcorn and eat out of the basket, which is essentially five bags of popcorn. I loved this movie."}, {"type": "line", "person": "Tim", "line": "Alright. Well, the second movie is Dead Man Down with Colin Farrell, my favorite actor uh, of my r- not- n- I mean, Dennis Quaid's my favorite all- full- all-time actor, but current cinema, current young actor, Colin Farrell-"}, {"type": "line", "person": "Gregg", "line": "Of this generation."}, {"type": "line", "person": "Tim", "line": "Yeah. Yeah- it's a grea- another great Colin Farrell movie. I feel like this guy doesn't know how to make bad movies. He's always in classics-"}, {"type": "line", "person": "Gregg", "line": "Yeah. Yeah, I've noticed that about him, it's alway- you're always saying five bags of popcorn after his name."}, {"type": "line", "person": "Tim", "line": "Right, so Colin Farrell gets.. The, uh, assured vote for the- at least a nomination for best supporting- best actor for Dead Man Down. Uh, that's my Oscer pick."}, {"type": "line", "person": "Gregg", "line": "It's tough, you know, um, it can only do, now that- nowadays, they do ten best picture nominations, and I feel like we've burned those already through the first three months of this ear with some of the movies that we've been looking at, and I guess that's a good thing. We're living in good times. And this is a great movie."}, {"type": "line", "person": "Tim", "line": "Alright, Dead Man Down, getting five bags of popcorn and three cups of soda from me."}, {"type": "line", "person": "Gregg", "line": "I'm gonna give it uh, five bags of popcorn and a little uh, mace spray, 'cause there's some pretty shady characters in this movie, you might wanna stay away from- protect yourself from."}, {"type": "line", "person": "Tim", "line": "Alright. Uh, now we're gonna do a brand new segment on the show. It's an opportunity for me to uh, talk to you guys about stuff outside of film, and ci- <burps> cinema. 'Scuse me. Outside of film is serious uh, stuff, not just about movies-"}, {"type": "line", "person": "Gregg", "line": "The tumor, or?"}, {"type": "line", "person": "Tim", "line": "Nope. Uh, this is my 60-Second Soapbox"}, {"type": "stage_direction", "stage_direction": "60-Second Soapbox Theme"}, {"type": "line", "person": "Tim", "line": "... Hi, my name is Tim Heidecker, and this is 60-Second Soapbox. You know, one of the big problems that we face is a question of, what is the role of government in our lives. Now, you might say that we need more government because we need more things, um, we- um, we need more things given to us, but it is a fact that when you look at history, more succ- it is better to not tax so much and have not as much regulations. Um, you could look at the economics of it, but we have a government now that is trying to take over everyone's lives. And if they can't do- they're- they shouldn't be allowed to do it, and we should be more encouraging of, uh, laws that say that there's- for less taxes and also for less regulation so that businesses can, uh, become, uh, more independent, and uh, that is the uh, fact, and is not just my opinion, but is also the facts... And also, uh, f- uh, we have to make sure that we're uh, uh, making a- a promise to our seniors."}, {"type": "stage_direction", "stage_direction": "stopwatch dings"}, {"type": "line", "person": "Tim", "line": "That was Popcorn- or, that was uh, 60-Second Soapbox. And let me know how you think of that segment... And uh, we've been new movies. Um, Oz the Great and Powerful, five star- five bags of popcorn, and Dead Man Down, five bags of popcorn. Um, thanks for watching."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Gregg", "line": "You said you weren't gonna do that anymore. When the- when we were doing the podcast, you weren't gonna do anymore political stuff."}, {"type": "line", "person": "Tim", "line": "It's not my problem."}, {"type": "line", "person": "Gregg", "line": "Well, it's- it's both of our problems, 'cause people don't-"}, {"type": "line", "person": "Tim", "line": "I feel good about it."}], "name": "S02E05"}