{"transcript": [{"type": "line", "person": "Tim", "line": "It's time to have fun at the movies again! We got great guests, interesting conversations, sneak peaks at the latest films, and I gotta tell ya, sometimes we don't agree on everything. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi, my name is Tim Heidecker. I am the uh, this is my show On Cinema at the Cinema, and it's a show where I talk about movies and give you guys a good, uh, st- to tell you about what's coming up in the movies. Uh, my guest today is uh, Ayaka Ohwaki. And Ayaka, thanks for coming on the show."}, {"type": "line", "person": "Ayaka", "line": "Thank you for having me."}, {"type": "line", "person": "Tim", "line": "And uh, Aywa- Ayaka is uh, staying with uh, my family. T- she's a foreign exchange student from uh, Japan."}, {"type": "line", "person": "Ayaka", "line": "Yes."}, {"type": "line", "person": "Tim", "line": "And uh, she is um, agreed to come on the show just to get a couple- a foreign perspective on movies, so it's been- been... wonderful having you stay with us and... Really been... cool to get to know you and..."}, {"type": "line", "person": "Ayaka", "line": "Yes."}, {"type": "line", "person": "Tim", "line": "Yes. You enjoying... s- your s- time here?"}, {"type": "line", "person": "Ayaka", "line": "Yes, I am so happy."}, {"type": "line", "person": "Tim", "line": "Yes... <clears throat> ...alright. Well,the movies we're talking about today are uh, G.I. Joe. G.I. Joe: Retaliation. Directed by Jon M. Chu and uh, S- Channing Sta- Channing Tatum again, and again with Bruce Willis, and again with Dwayne Johnson. Uh, three of so- three- some of my favorite current film stars. I loved this movie. I loved the first one, but somehow they've m- m- managed to outdo themselves and make a- another great G.I. Joe film. Your thoughts? I give it five bags of popcorn."}, {"type": "line", "person": "Ayaka", "line": "Um, I'll give one bag of popcorn and uh, five cups of soda."}, {"type": "line", "person": "Tim", "line": "Okay. So you didn't care- or you didn't- or- 'cause you- one bag of popcorn? 'Cause uh, we- uh, we went to see this... uh, last night, and uh, you se- you seemed to enjoy it."}, {"type": "line", "person": "Ayaka", "line": "I just- not big fan of popcorn."}, {"type": "line", "person": "Tim", "line": "Oh. well... okay. So. But the popcorn isn't to be eaten, it's just to signify or reflect a r- star."}, {"type": "line", "person": "Ayaka", "line": "Oh, okay. Then uh, four stars."}, {"type": "line", "person": "Tim", "line": "Four bags of popcorn from Ayaka! Very cool. Must be different seeing American movies without subtitles."}, {"type": "line", "person": "Ayaka", "line": "Yes, I didn't understand at all."}, {"type": "line", "person": "Tim", "line": "Oh, boy. Well, we also went and say Tyler Perry's The Marriage Counselor with the- directed by the Tyler Perry. Starring Tyler Perry. Or uh, uh, w- well, uh, Vanessa Williams, and the Ken- oh, and Kim Kardashian was in this. Kinda funny to see her in a movie. Uh, I l- thought this movie was funny, not my uh, you know, not my favorite kind of movie, to be honest with you. But uh, it was- it was okay. Thought it was very well-made, so I have to give it four bags of popcorn."}, {"type": "line", "person": "Ayaka", "line": "Um, I'll do three bags of popcorn. And uh, three cups of soda."}, {"type": "line", "person": "Tim", "line": "Did you li- so, di- what did you think of the..."}, {"type": "line", "person": "Ayaka", "line": "Um, it's avelage, I think. Avelage."}, {"type": "line", "person": "Tim", "line": "Okay, average."}, {"type": "line", "person": "Ayaka", "line": "Ah, average."}, {"type": "line", "person": "Tim", "line": "...Yeah... Um, let's take a look at a segment uh, called On C- uh, On Cinema Presents: uh, Popcorn Classics: BTC. Take it away."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics: Behind the Curtain Intro"}, {"type": "line", "person": "Gregg", "line": "Welcome to another edition of Popcorn Classics: BTC. We're here with mister Jimmy McNichol. And today, we're looking at Smokey Bites the Dust-"}, {"type": "line", "person": "Jimmy McNichol", "line": "Oh boy-"}, {"type": "line", "person": "Gregg", "line": "A film that you starred in. Uh, how many of copies of the movie do you own?"}, {"type": "line", "person": "Jimmy McNichol", "line": "Um, actually, three. My wife's been collecting 'em."}, {"type": "line", "person": "Gregg", "line": "Did they send you a box of uh, videos?"}, {"type": "line", "person": "Jimmy McNichol", "line": "They sent me one."}, {"type": "line", "person": "Gregg", "line": "What's the best place to find it? Flea markets, or internet, or-"}, {"type": "line", "person": "Jimmy McNichol", "line": "I think on the intern-"}, {"type": "line", "person": "Gregg", "line": "What would you say?"}, {"type": "line", "person": "Jimmy McNichol", "line": "On the internet."}, {"type": "line", "person": "Gregg", "line": "Why do you think Smokey Bites the Dust is a Popcorn Classic?"}, {"type": "line", "person": "Jimmy McNichol", "line": "Um, it's got a lotta um, thrills and action in it, um, it's just a constant, non-stop uh, you know, uh, classic of just chasing, you know, cars, and crashing-"}, {"type": "line", "person": "Gregg", "line": "Was it uh, scary being in the car during the big chases?"}, {"type": "line", "person": "Jimmy McNichol", "line": "No."}, {"type": "line", "person": "Gregg", "line": "Do you think the price of DVDs will eventually come down?"}, {"type": "line", "person": "Jimmy McNichol", "line": "Over time, they're gonna e- eventually phase out to even smaller discs is the- at least what technology's saying."}, {"type": "line", "person": "Gregg", "line": "Do you think film critics and experts are becoming as important to the movie-going public as actors and directors?"}, {"type": "line", "person": "Jimmy McNichol", "line": "I think it's important that films are reviewed and that there's uh, there's good, you know, viable critics out there that can actually give the audience, you know, the heads up, so that they're not wasting their time going and seeing a movie that- that really is just okay."}, {"type": "line", "person": "Gregg", "line": "I love your hit single from uh, from seventies called He's a Dancer. Can we expect more music from you in the future?"}, {"type": "line", "person": "Jimmy McNichol", "line": "Absolutely. As a matter of fact, uh, the beginning of two thousand thirteen, I'll be releasing a new album with music videos. Previews of the music videos can be found at finding Jimmy dot com."}, {"type": "line", "person": "Gregg", "line": "What size of popcorn do you get when you go to the movies?"}, {"type": "line", "person": "Jimmy McNichol", "line": "I usually get a large bag of popcorn, a box of junior mints, and I eat the popcorn and the junior mints together at the same time!"}, {"type": "line", "person": "Gregg", "line": "Thank you so much! Back to you, Tim."}, {"type": "line", "person": "Tim", "line": "Alright, well that was cool!"}, {"type": "line", "person": "Ayaka", "line": "Yes."}, {"type": "line", "person": "Tim", "line": "Yes. Good to see ya, Gregg. Thanks, Gregg, for that segment, and uh... alright, well, that's our show and it was- thanks for coming on the show, and-"}, {"type": "line", "person": "Ayaka", "line": "Thank you!"}, {"type": "line", "person": "Tim", "line": "See you back at home."}, {"type": "line", "person": "Ayaka", "line": "Yes."}, {"type": "line", "person": "Tim", "line": "And uh, she tau- actually taught be how to make sushi the other night, which was neat... Thanks for watching"}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "I thought that was pretty good!"}, {"type": "line", "person": "Ayaka", "line": "Yeah!"}, {"type": "line", "person": "Tim", "line": "[...]"}, {"type": "line", "person": "Tim and Ayaka", "line": "<laugh>"}, {"type": "line", "person": "Ayaka", "line": "Where's Gregg?"}, {"type": "line", "person": "Tim", "line": "He's coming- he'll be back soon."}, {"type": "line", "person": "Ayaka", "line": "Oh, okay. Good."}], "name": "S02E08"}