{"transcript": [{"type": "line", "person": "Tim", "line": "This is a great movie, you're not gonna regret it. I'm Tim Heidecker. Great guests, great conversations, and a few arguments. It's On Cinema at the Cinema."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker, I am the host of my own show, that- which is this show, called On Cinema at the Cinema, and it's a webshow where we discuss, uh, what movies are coming out, and why they're g- and uh, whether or not they're good, n- or if you should skip them. Uh, my guest is uh, film expert Gregg Turkington."}, {"type": "line", "person": "Gregg", "line": "Hey guys. Good to be here, and hopefully, we can help you out with some new opinions today."}, {"type": "line", "person": "Tim", "line": "Well, uh, before we get into that, I just wanna address uh, people have been writing and asking about my medical conditiona and um, do appreciate that, and thank you guys very much for the concern. I wanted to give you an update that uh, w- my family and I discussed this with our doctor and I am not gonna be getting the surgery."}, {"type": "line", "person": "Gregg", "line": "Aw."}, {"type": "line", "person": "Tim", "line": "Um... I'm not gonna be getting the surgery. Per the doctor's suggestion, first of all. And second of all, because of homeopathic medicine that is available. That we are looking into, and there are different ways of treating the situation that are- do not involve invasive surgery, such as uh, different supplements. So thank you, and uh, you know, let's... not worry so much about my health, and let's worry about movies, whether or not movies are good. Let's uh, start off with our first movie here, 21 and Over, a comedy with jirector Lon- or director Jon Lucas and Scott Moore, a directing team, you don't see that very often, with Miles Teller, Justin Choon, uh, and Skylar Astin. This is about the night before it uh- a big medical school exam, a promising student celebrates his twenty-first birthday with his two best friends. As you can imagine, this is lots of funny drinking jokes and uh, getting- people getting messed up and also funny uh, six- situations that you don't often see in movies these days-"}, {"type": "line", "person": "Gregg", "line": "It's very funny, I don't know that it's responsible to... encourage this sort of, um, alcohol abuse, but, you know, i- if you watch old Flintstones cartoons, they do things in that that you would never do in real life, and it is just a movie, so if you enjoyed The Hangover and Hangover 2, and that sort of thing, you- you'll probably enjoy this, uh, it could be a case of too many cooks spoiled the broth in that two directors I think sometimes it gets kinda messy. But the laughs still keep coming and uh, I had a great time, I would uh, strongly, strongly recommend this movie-"}, {"type": "line", "person": "Tim", "line": "I uh, I thought it was hilarious, I um, found myself just... completely in love with the movie, and it- uh- I was going through a period- I am going through a period where I need a good laugh, and-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "And laughter's the best medicine-"}, {"type": "line", "person": "Gregg", "line": "'Course surgery, too, would be a good medicine, but-"}, {"type": "line", "person": "Tim", "line": "Alright, that's not... appropriate. Um, uh, it reminds me of some of those old Lat- National Lampoons movies, I think it would've been even a better movie if somebody like John Belushi or Ja- uh Dan Aykroid coulda stepped up into the driver seat of this movie and- and that- that would've made this movie clearly a c- a classic. But I did love it, and I thought it made me laugh, and that's what I needed right now, so I give it five bags of popcorn."}, {"type": "line", "person": "Gregg", "line": "I think if you'd tacked the National Lampoon name onto this and called it National Lampoon's-"}, {"type": "line", "person": "Gregg and Tim", "line": "21 and Over-"}, {"type": "line", "person": "Gregg", "line": "It would've been a five bagger. Uh. I'm gonna give it five bags anyway, though, 'cause I think that the world does need a laugh, and I'll throw in uh, maybe a shot of jagermeister."}, {"type": "line", "person": "Tim", "line": "<guffaws> ...Well, that's not legal. Unless you are twenty one and over, which is the name of the movie."}, {"type": "line", "person": "Gregg", "line": "That's why I chose jagermeister-"}, {"type": "line", "person": "Tim", "line": "And, ironically, you have to be seventeen and over to see this movie, uh... and perhaps, that can be the sequel, Seventeen and Under. Or over. Be interesting to see what happens to this character once he becomes a doctor. Maybe you could call the movie, uh... Or d- uh, call the movie Doct- uh, uh, something about doctors."}, {"type": "line", "person": "Gregg", "line": "Doctor 21."}, {"type": "line", "person": "Tim", "line": "Mhm... Anyways, we're not here to write movies, that's for Hollywood to take care of, there- there's plenty of talented writers, uh, to take care of the writing of the sequel. But uh, as fans and critics of film, we wanna say, see what you can do to make this happen. Doctor S- Doctor 21, would be our suggestion. Not the best, but... you'll have to live with it. [...]-"}, {"type": "line", "person": "Gregg", "line": "Well at least it's original, 'cause 21 and Over is just something you see on signs at bars and things like that, whereas Doctor 21 is an original idea."}, {"type": "line", "person": "Tim", "line": "Alright, well the other movie we're talking about today is uh, Jack and the Giant Slayer, directed by Brian Singer. Um, maybe his last name should be Brian Director."}, {"type": "line", "person": "Gregg", "line": "He probably started out, though, doing smaller jobs, so you couldn't have the name Director 'til you become the director you'ldn't want to have to change your name as you move up the ranks-"}, {"type": "line", "person": "Tim", "line": "Mm no, I know. I'm just trying to make a little joke. Doesn't matter. Um, Ewan McGregor and Stanly Tookey, and Nicole, uh, Haut, and Bill Night is stars in this movie, and this is about a young farmer who leads an expedition into the giant's kingdom to rescue a kidnapped princess. I wish that this movie uh, just went on and on and on. I loved it so much. I thought to myself, aha, they're still making these kind of movies. And we get to see it- we get to live in a time when classic movies are being made. Imagine what it'd be like for our grandparents to grow up when th- Gone with the Wind and, uh, movies of that... stature were being made, well now, here we are, alive and well, listening, uh w- getting to see Jack and the Giant Slayer. Six bags of popcorn for me, and a- make the giant sized bags of popcorn."}, {"type": "line", "person": "Gregg", "line": "Well, they are, the ones that we use are already the biggest size of popcorn, so."}, {"type": "line", "person": "Tim", "line": "Then make them the- then make them as they are."}, {"type": "line", "person": "Gregg", "line": "I'm gonna say five bags of popcorn and um, maybe another five. Yeah, when I see a movie like this, the first thing that pops in my head is I love this job. Uh, getting to watch movies like this and uh, getting to talk about them, and uh, to sort of provide a public resource so that people can get information about this movie-"}, {"type": "line", "person": "Tim", "line": "Yeah, uh, no I hear it- I hear that, loud and clear, and, um... Yeah, I just didn't think about it- those- in that way until now. So uh, I'm letting that sit in."}, {"type": "line", "person": "Gregg", "line": "Well, while you think about that, I've got something for you to think about, who are watching, which is another edition of Popcorn Classics."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics Theme"}, {"type": "line", "person": "Tim", "line": "Some- uh, somebody told me, uh, that you have a special Popcorn Classic for us today, that's related to, uh, Jack?"}, {"type": "line", "person": "Gregg", "line": "Yes, I do. Today's movie, I wouldn't call it exactly a prequel, I wouldn't say it's related at all to uh, James and the Giant Slayer, but the movie does involve giants. It's called My Giant."}, {"type": "line", "person": "Tim", "line": "Put it down."}, {"type": "line", "person": "Gregg", "line": "And um, in this movie, Billy Crystal is a man who becomes his friend, who's uh, double his size, and uh, if you- if you look at the box, or if you've seen the movie, uh, you know that this guy, I don't know what causes you to be eight feet tall, but this actor is very, very tall. Maybe it's just that Billy Crystal's very small, I don't know, but it's very funny to see these guys together, and just look at the difference between the heights, it's uh, hilarious in every gene, and-"}, {"type": "line", "person": "Tim", "line": "This is just C- but this is CGI, I mean, that's not-"}, {"type": "line", "person": "Gregg", "line": "No, that's uh, that-"}, {"type": "line", "person": "Tim", "line": "He's really not that tall."}, {"type": "line", "person": "Gregg", "line": "No that's- he's an actor, and uh, he's in a lot of films, he's a very well-known actor, and-"}, {"type": "line", "person": "Tim", "line": "No, no, no. This- this is like in Lord of the Rings, where you have big, tall Gandalf, with um, the little hobbit man. That's- that's just uh, that's just st- CGI [...]-"}, {"type": "line", "person": "Gregg", "line": "No, this guy- if you get the world's shortest actor, Billy Crystal, and the world's tallest actor, this guy, and you put 'em together-"}, {"type": "line", "person": "Tim", "line": "No."}, {"type": "line", "person": "Gregg", "line": "You get a- a situation like this-"}, {"type": "line", "person": "Tim", "line": "Gregg, I s- I hate to do this to you on the- on the sh- right in the- the show, but this is done through computer graphics."}, {"type": "line", "person": "Gregg", "line": "They didn't have that when this movie was made. This movie is several years old-"}, {"type": "line", "person": "Tim", "line": "Yes, they did. This was only nineteen ninety-eight or something like that. Look it- I mean that's... Can you see that?"}, {"type": "line", "person": "Gregg", "line": "Yeah, but Billy Crystal-"}, {"type": "line", "person": "Tim", "line": "That guy's sma- that guy- that- this is all f- it's- it's uh, special effects. Nineteen ninety-eight. I hit it- hit the nail on the head. This is-"}, {"type": "line", "person": "Gregg", "line": "Yeah, well when did The Phantom Menace come out, because that's when they pioneered this sort of CGI effects-"}, {"type": "line", "person": "Tim", "line": "They've been doing this- th- it's not CGI, it's special effects, it's an optical illusion. All this guy had to do was be much closer to the camera than Billy Crystal and that's all-"}, {"type": "line", "person": "Gregg", "line": "Well, if you look at the sidewalk, there a- there- i- exact same spot, look at the shadows."}, {"type": "line", "person": "Tim", "line": "That's what the fixed in post. Alright, thank you guys for watching."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "This is all-"}, {"type": "line", "person": "Gregg", "line": "No, because Billy Crystal's like this tall-"}], "name": "S02E04"}