{"transcript": [{"type": "line", "person": "Tim", "line": "Should I see a movie this weekend? Aaaaaah! This is as good as a movie can get, and it's so great that they're still making these kinds of movies! It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, this is Tim Heidecker, On Cinema at the Cinema, and uh, I um, it's been a tough week... So uh, I'm gonna- just gonna turn it over to Gregg. Can't do it today."}, {"type": "line", "person": "Gregg", "line": "The tumor?... Hey guys. Welcome to On Cinema, uh, the webcast where we discuss new movies, review those movies,and then give recommendations to you, the viewer, as to whether or not to see those movies. And this week, we've got two for you, and what are they, Tim?... Okay... Uh, this week, um, we're reviewing two movies. Uh, the first one, uh, is called Oblivion. And it's a science fiction, uh-"}, {"type": "line", "person": "Tim", "line": "<chuckles and sighs>"}, {"type": "line", "person": "Gregg", "line": "Science fiction movie. This is the new Tom Cruise movie, and of course you all know that, because everyone keeps tabs on Mister Cruise. And here he's joined by Morgan Freeman, and this film is a delight. It's uh, a science fiction movie, it's a little strange, but if you're familiar with Star Trek, or The X-Files, or anything of that nature, you won't be too shocked at some of the other worlds that they explore, visit, and do battle with, in Oblivion. Um, this is the real deal. I would give this movie five tubs of popcorn, maybe put a ring around each one like the planet Saturn. Tim?"}, {"type": "line", "person": "Tim", "line": "I loved this movie, I love Tom Cruise, and uh, the love sci-fi, and uh, you know, it was a lot of fun to watch with my family."}, {"type": "line", "person": "Gregg", "line": "Uh, how is- how is your family doing? How is the- is the tumor, uh, gone down in size, or?.."}, {"type": "line", "person": "Tim", "line": "No, they are, uh, not- it's not a tumah, it is, um, blood clots, and uh, um, they have doubled! So they're now twelve... of once- of where there once was six."}, {"type": "line", "person": "Gregg", "line": "You should've gotten surgery, which is what I was suggesting all along."}, {"type": "line", "person": "Tim", "line": "Well. That ship has sailed. And uh... Continue."}, {"type": "line", "person": "Gregg", "line": "... Alright. Well, the next movie, um, as long as we've done science fiction, let's do s- a little bit of horror too. Um, this is called Scary Movie 5, and it's from the Zucker brothers, and stars Lindsay Lohan, Charlie Sheen, and the whole Scary Movie gang. Um, if you've ever seen a Scary Movie, or uh, one of the Scary Movie series, you know what you're in for, which is a lotta laughs, couple of little chills, little fright, here and there, and a little bit of eye candy in the form of Miss Lindsay Lohan. And uh, the plot itself isn't a- a- as important as the reaction that it will get from you, which is, uh, a good time. I can hardly recommend Scary Movie 5. I give it five tubs of popcorn. Tim?"}, {"type": "line", "person": "Tim", "line": "I didn't get a chance to see this movie. Um-"}, {"type": "line", "person": "Gregg", "line": "I think you'd like it."}, {"type": "line", "person": "Tim", "line": "We've been uh, spending time... saying goodbye. Looking at old pictures, and going through stuff, and there's so much stuff. You look in your s- my storage room that we have, it's just so much stuff."}, {"type": "line", "person": "Gregg", "line": "Well this might, uh, be a fun thing to do, you know. I mean, I guess-"}, {"type": "line", "person": "Tim", "line": "Yeah, I'm trying to just manage my time. You know? N- time is so valuable to me right now that I can't, uh, something like Scary Movie is just... gonna be a waste-"}, {"type": "line", "person": "Gregg", "line": "Well, it's not really a scary movie. It's a comedy, it's a parody of uh, scary movies. It's actually quite funny. There are a couple of scary moments in it, but um, if you need something to get your mind off your troubles, um, I recommend Scary Movie 5. I give it five tubs of popcorn."}, {"type": "line", "person": "Tim", "line": "I've been going back and watching some of my favorite movies. Um, movies that make me feel good, that I'm comfortable around, that uh, bring a smile to my face. I was never a big fan of the Scary Movie franchise. I think it's junk, and uh, I think those guys are just the worst. And they're just profiting off of violence and prova- profiting off of gore and- and horror, and people t- suffering. And I would rather watch something that makes me feel good. Sound of Music or something like that."}, {"type": "line", "person": "Gregg", "line": "Or Oblivion, our other movie, um, with Tom Cruise, which is a lot of fun-"}, {"type": "line", "person": "Tim", "line": "I wanna thank you for uh, filling in here, and uh, and to Ayaka, who was such a big part of this season for us, and uh, and to my family, and to my- and all the people that watch the show-"}, {"type": "line", "person": "Gregg", "line": "Why don't you just get the surgery on this tumor-"}, {"type": "line", "person": "Tim", "line": "It's not that-"}, {"type": "line", "person": "Gregg", "line": "and then stop with this, because it's not-"}, {"type": "line", "person": "Tim", "line": "No. It is not a tumah."}, {"type": "line", "person": "Gregg", "line": "It's not incurable, it's not an incurable situation."}, {"type": "line", "person": "Tim", "line": "It is not a tumah... There was a very small window, uh, during which, surgery would've been appropriate, and that window has closed-"}, {"type": "line", "person": "Gregg", "line": "It's closed by you and your idiot doctor, because I've studied up on this, and I don't think that's really how it works with a tumor-"}, {"type": "line", "person": "Tim", "line": "I know, well. You don't know anything about it's not a tumor. It's a blood clot. It's uh, you know, twelve blood clots on my brain. And uh-"}, {"type": "line", "person": "Gregg", "line": "There's no reason for this. Just go-"}, {"type": "line", "person": "Tim", "line": "Well, r-"}, {"type": "line", "person": "Gregg", "line": "Get a real doctor, get some surgery, and let's get back reviewing movies, and enough with the erratic episodes and things, because-"}, {"type": "line", "person": "Tim", "line": "Alright. Well, we're not- this isn't the stone age. The dark ages, and uh, it's barbaric, uh, to do what they're- what they were suggesting. And that's just the choice we made, so. Um, anyway. Thank you guys so much for being a part of the On Cinema Family, and thank you to Gregg for all your work, and- and uh, hope- hope we made a small difference, and uh, let me just say um, from um, myself and the entire crew here, uh, I hope you guys will remember me, and, you know, whenever you go to see a movie, whenever you go to get a p- a popcorn."}, {"type": "line", "person": "Gregg", "line": "Especially if you go to a movie about a stubborn person that won't get surgery when they need surgery that would fix the problem. Definitely think of him then."}, {"type": "line", "person": "Tim", "line": "<motions for lights out>"}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "Thank you guys."}], "name": "S02E10"}