{"transcript": [{"type": "line", "person": "Tim", "line": "I love this movie! Skip it. You're gonna wanna see this one in the theaters. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker, and you're watching On Cinema at the Cinema. It's a show where we talk about different movies coming out this weekend and give you our reviews. My reviews and my guest reviews. And the guest this week is Gregg Turkington. Gregg?"}, {"type": "line", "person": "Gregg", "line": "Hey guys! Uh, glad to be here and to share my opinions and my expertise with all of you."}, {"type": "line", "person": "Tim", "line": "Well, thank you very much, Gregg. And uh, here we are in March, and uh, wow. It's been a couple of months of great movies-"}, {"type": "line", "person": "Gregg", "line": "The class of two thousand thirteen has some real uh, real winners in it-"}, {"type": "line", "person": "Tim", "line": "Mhm. Although, two thousand twelve had to have had some best movies I've seen in a long time-"}, {"type": "line", "person": "Gregg", "line": "The Hobbit was fantastic, and-"}, {"type": "line", "person": "Tim", "line": "Jack Reacher."}, {"type": "line", "person": "Gregg", "line": "We're still talking about, still thinking about-"}, {"type": "line", "person": "Tim", "line": "Jack Reacher probably'll be out on video any day now. Looking forward to owning that."}, {"type": "line", "person": "Gregg", "line": "I wasn't as big of a fan, but."}, {"type": "line", "person": "Tim", "line": "Well let's talk about today's movies. Um, Carrie... It's just Carrie. With Kimberly Price directing, Peirce, and uh, Chloë Grace Moretz, Jim, uh, Julianne Moore, and Judy Greer. And this is uh, what a great movie. Um, of course, it's a remake, and you know how much I love remakes. Uh, because it's finally- you get a chance to, uh, perfect- you get- you had your first chance... and s- and the original Carrie was great, but this one is even better than that, so."}, {"type": "line", "person": "Gregg", "line": "Well maybe third time will be a charm."}, {"type": "line", "person": "Tim", "line": "Mmm."}, {"type": "line", "person": "Gregg", "line": "Um, yeah, Carrie's a- d- a- I'll tell you what. I- I probably shouldn't say anything about this 'cause I don't wanna give away the ending, so, watch it for yourself and see. I'm not gonna give away the ending."}, {"type": "line", "person": "Tim", "line": "Alright, well what did you think? Did you like the movie?"}, {"type": "line", "person": "Gregg", "line": "I liked it a lot. I liked it a lot. I just... You're gonna see it for yourself to see that ending. I'm not gonna give it away."}, {"type": "line", "person": "Tim", "line": "Okay. Well, I mean, I don't think you have to give away the ending to say what you thought..."}, {"type": "line", "person": "Gregg", "line": "It's a horror movie, so it's frightening... You will not believe the ending, so, watch the movie and see the ending. I'm just gonna leave it at that, I don't wanna give aw- give it away."}, {"type": "line", "person": "Tim", "line": "Alright, well you're not... I don't think you're in any position to give anything away."}, {"type": "line", "person": "Gregg", "line": "And I don't want- I don't wanna stay in that position, 'cause... you gotta see this for yourself and see how it ends. Don't look at the spoilers. We're not gonna spoil anything here today."}, {"type": "line", "person": "Tim", "line": "'Course there's the classic scene where she gets drenched in blood, which we all remember from the original, because it's prom night-"}, {"type": "line", "person": "Gregg", "line": "Mm. Well, I'm not talking about any of it. I just- don't- just let it lay. Let people f- watch it for themselves, and they'll find out how it ends..."}, {"type": "line", "person": "Tim", "line": "I don't see what the big deal is."}, {"type": "line", "person": "Gregg", "line": "Well, I- it's just you ruin the movie if you give away the ending, so, let's just-"}, {"type": "line", "person": "Tim", "line": "Well I'm not giving away the ending. We're just talking about, you know, I can tell you that she has telekinetic powers, she has blood spilled on her and everything-"}, {"type": "line", "person": "Gregg", "line": "Sh- Just... watch this movie, see this movie-"}, {"type": "line", "person": "Tim", "line": "You don't have to tell- we don't- we've never t- tell the endings. I don't see what this is- what the big deal is-"}, {"type": "line", "person": "Gregg", "line": "Watch the whole thing. It's a scary movie. Uh, and it has got a truly memorable ending, and that's all I'm gonna say. <winks>"}, {"type": "line", "person": "Tim", "line": "Sh- sh- sh- It's not like The Crying Game, or some movie where you can't-"}, {"type": "line", "person": "Gregg", "line": "Let's just- let's just drop it, because I don't wanna spoil it for people that want to see the movie and don't wanna find out ahead of time how it ends."}, {"type": "line", "person": "Tim", "line": "I agree... Let's move on. I give it six- uh, four bags of popcorn."}, {"type": "line", "person": "Gregg", "line": "I'll let you wait and see what I give it."}, {"type": "line", "person": "Tim", "line": "...No review?"}, {"type": "line", "person": "Gregg", "line": "I don't wanna give away anything. I think if- if you heard my rating, might give a little bit of a clue as to how-"}, {"type": "line", "person": "Tim", "line": "I think you're making- I think you're making fun of this, but I'm not sure why. Or how-"}, {"type": "line", "person": "Gregg", "line": "But I'm not making fun of it. I'm trying to protect the viewer, 'cause I'm sick of these reviewers that tell you how these things end and then, it's-"}, {"type": "line", "person": "Tim", "line": "Well, we're not talking about the ending, just tell me what- if you liked the movie or not."}, {"type": "line", "person": "Gregg", "line": "Well I loved the movie. And that's the point. I love the movie and I want people to be able to see it for themselves and not spoil it for them, with spoilers."}, {"type": "line", "person": "Tim", "line": "...Alright. Whatever. You're an idiot"}, {"type": "line", "person": "Gregg", "line": "Well, I mean, this is a good movie. I'm gonna give it five bags of popcorn, but I'm gonna put a curtain around them so you can't tell how many until you've seen the movie yourself."}, {"type": "line", "person": "Tim", "line": "Okay."}, {"type": "line", "person": "Gregg", "line": "And some of those little hot cinnamon- those spicy little candies. 'Cause it has a hell theme."}, {"type": "line", "person": "Tim", "line": "You just told me how many bags. Doesn't matter. It's stupid."}, {"type": "line", "person": "Gregg", "line": "Well, it's not as important as the ending of the movie, so-"}, {"type": "line", "person": "Tim", "line": "Alright, second movie is The Incredible Burt Wonderstone, directed by Don Scardino. And that stars my favorite actor- my favorite comedy actor, Jim Carrey, Steve Carell, Olivia Wilde, and Steve Buscemi. So a couple of Steves in this movie. After breaking up with his stage partner, Vegas magician must fight for relevance against a hip new street magician. Uh, this was very funny, um, and s- and had a sweet- and had a good heart to it, and uh, it was fun to see Jim Carrey and Steve Carell play off each other and do their different- 'cause there are different styles of comedy out there, and these guys are different in different ways, but, um, definitely one of my favorite movies of the year, definitely my favorite Jim Carrey movie."}, {"type": "line", "person": "Gregg", "line": "And, you know, I think this is the year the Oscer is gonna smile on Jim Carrey because I think he gave a great performance, and it's a funny movie, but it's not strictly for laughs. It has a message too, so I do think he'll get the Oscer."}, {"type": "line", "person": "Tim", "line": "And uh, supposedly, um, very very good- very well-made. And just five bags of <burps> pop-"}, {"type": "line", "person": "Gregg", "line": "Five bags of popcorn, and each bag- inside each bag, when you open it up, you find an Oscer for Jim Carrey, 'cause this is his all-time best performance, and I am a big fan as well-"}, {"type": "line", "person": "Tim", "line": "Yes, and I hate magic, uh, because I'm-"}, {"type": "line", "person": "Gregg", "line": "I like magic!"}, {"type": "line", "person": "Tim", "line": "Yeah. I don't like magic. Uh, and I never did, but this one- suddenly I walked out of this movie theater going, aah. Now I wanna go see magic. After I saw the movie, I went to the Toys R Us near our house, and uh, picked up a little beginners magic kit-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "And it was uh, magic things, and um, and uh, lo and behold, they didn't have some of the tricks that were in this movie, but, I did learn about the- the cups and the balls and everything like that, and- and it's uh, it's- it's- uh, you know, because of movies like this, you get exposed to different kinds of culture."}, {"type": "line", "person": "Gregg", "line": "And that will be a fun segment for the show instead of that soapbox, uh, one minute soapbox, is maybe you do magic for a minute or something like that, and people would like to-"}, {"type": "line", "person": "Tim", "line": "No, well I'm not good at- I'm not good enough yet. Takes years of practice."}, {"type": "line", "person": "Gregg", "line": "Well, we're gonna be doing this show for years, I hope."}, {"type": "line", "person": "Tim", "line": "...Alright. Uh- ah, let's keep the show moving along. Before we do um, the next segment, uh, here's where The Incredible Burt Wonderstone is playing near you."}, {"type": "stage_direction", "stage_direction": "Movie Showtimes graphic and song"}, {"type": "line", "person": "Tim", "line": "Alright, so again, if you uh, don't see your city there, uh, uh, go ahead and look it up on the internet, and uh, you should be able to find, um, where the movies are playing."}, {"type": "line", "person": "Gregg", "line": "Or the newspaper-"}, {"type": "line", "person": "Tim", "line": "Or the newspaper."}, {"type": "line", "person": "Gregg", "line": "And that's a resource you can use."}, {"type": "line", "person": "Tim", "line": "...Alright. Uh, let's do the Pope- uh, Popcorn Classics."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics Theme"}, {"type": "line", "person": "Tim", "line": "Alright, today, Popcorn Classic, we uh, Gregg, what did you, what did you brought in for us?"}, {"type": "line", "person": "Gregg", "line": "I brought in a movie that uh, is pretty cool. It's called The Mod Squad"}, {"type": "line", "person": "Tim", "line": "Mm"}, {"type": "line", "person": "Gregg", "line": "And this was a TV show uh, back in the day, but they've sort of hipped it up with some stylized characters, and some new music. It's pretty flashy movie and it's a lot of fun. If you haven't seen it, you y-"}, {"type": "line", "person": "Tim", "line": "Well, I actually don't recommend that. I recommend this. Uh, Dennis Miller Live, one of my favorite comedians. It's uh, he's a standup comedian and- nd- uh, sometimes I feel like we get sort of fo- hyper-focused on um, on these movies, when videos ha- can be of- of concerts or standup material, or TV shows, so-"}, {"type": "line", "person": "Gregg", "line": "This isn't a movie. This is just a-"}, {"type": "line", "person": "Tim", "line": "That's what I'm saying, it's not just-"}, {"type": "line", "person": "Gregg", "line": "This is just episodes- yeah, this is- well, this show's called On Cinema. It's not called O-"}, {"type": "line", "person": "Tim", "line": "Well I thought we'd mix it up."}, {"type": "line", "person": "Gregg", "line": "On Television. It's not called On Television, so, uh, I do stand by my choice of The Mod Squad-"}, {"type": "line", "person": "Tim", "line": "Well, if you don't wanna watch just another same old movie of a remake, all we do is remakes lately. This is original comedy, original content from one of the great ones, Dennis Miller. And I watched- ah- this- y- don't borrow mine, because i- actually I've watched this tape so many times that it's uh, the quality of it's very bad right now-"}, {"type": "line", "person": "Gregg", "line": "Well the quality of it is very bad. That's why The Mod Squad is the movie you should watch. This movie actually did pretty well at the time it came out, and it's kind of going into a second life as a popular movie on the video rental scene, something to play at a party, or-"}, {"type": "line", "person": "Tim", "line": "Dennis Miller Live features uh, celebrity scandals, political subterfuge, social deviance-"}, {"type": "line", "person": "Gregg", "line": "It's not a movie."}, {"type": "line", "person": "Tim", "line": "This guy's the king of the catchphrase-"}, {"type": "line", "person": "Gregg", "line": "It's not a movie. Just 'cause it's on video-"}, {"type": "line", "person": "Tim", "line": "Doesn't matter, I know. That's why I'm trying to expand- expand our horizons. He's the king of the catch-"}, {"type": "line", "person": "Gregg", "line": "Well then why don't you take somebody's home movies-"}, {"type": "line", "person": "Tim", "line": "Hold on."}, {"type": "line", "person": "Gregg", "line": "Some- somebody's home movies that you find at a thrift store and review that?"}, {"type": "line", "person": "Tim", "line": "Lemme get this. King of the catchphrases, king of the references. This guy makes you feel smarter just by listening to him, even though sometimes I don't even know what he's talking about. 'Cause his references are so <touches thumb an index finger> uh, very specific and about weird stuff-"}, {"type": "line", "person": "Gregg", "line": "Specific to TV, but not- it's not a movie [...]-"}, {"type": "line", "person": "Tim", "line": "No, but this- You could put this out in the theaters and it would be a blockbuster smash, because-"}, {"type": "line", "person": "Gregg", "line": "They tried it and it failed. He's never had a hit movie, and he never will-"}, {"type": "line", "person": "Tim", "line": "No, you could- u- use in the net. But also, this- you could put this out right now, re-release it in the cinemas, it would be a huge smash because the comedy's timeless, it's like an evergreen tree. Uh, the C-"}, {"type": "line", "person": "Gregg", "line": "It's all jokes about things that happened fifteen years ago, nobody wants to hear about"}, {"type": "line", "person": "Tim", "line": "The- The Wallstreet Journal says, aah, aah yes, but The- The Wallstreet Journal says his incisive comic riffs"}, {"type": "line", "person": "Gregg", "line": "It's all Bob Dole Jokes from-"}, {"type": "line", "person": "Tim", "line": "Hold on, listen to thi- aah, The Wallstreet Journal says his incisive comic riffs and rants merit raves. Guess what folks? This is my pick of the week, my Popcorn Classic, Dennis Miller Live."}, {"type": "line", "person": "Gregg", "line": "Well you don't- It's not- it's- yeah, it's my segment, so-"}, {"type": "line", "person": "Tim", "line": "Well, it's my show. So, thanks for watching."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "This is- lookit- it's two hours long."}], "name": "S02E06"}