{"transcript": [{"type": "line", "person": "Tim", "line": "This is a great movie, you're not gonna regret it! You're gonna wanna skip this movie. Have you ever wondered what movies should I see this weekend? Well, we're here to help. It's On Cinema at the Cinema."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker and we are a- again back watching On Cinema at the Cinema. It's a show where we talk about movies and- and uh... um, give you- it's a review movie show. And uh, todays, uh, guest is Gregg Turkington."}, {"type": "line", "person": "Gregg", "line": "<tck> Hey guys, and uh, welcome to our program."}, {"type": "line", "person": "Tim", "line": "Welcome to, uh, my program. Don't even say that. Today we're doing two movies and they're- they're unique in that they're both sort of these popcorn movies that you love so much, and I love as well-"}, {"type": "line", "person": "Gregg", "line": "Popcorn Movies-"}, {"type": "line", "person": "Tim", "line": "Yeah, and uh, so-"}, {"type": "line", "person": "Gregg", "line": "Yeah, these are fun movies. I think that people watching are gonna-"}, {"type": "line", "person": "Tim", "line": "I will... Chill, 'kay? Chill."}, {"type": "line", "person": "Gregg", "line": "I'm just really excited ab-"}, {"type": "line", "person": "Tim", "line": "I know. Chill. So I thought for d- for just a change, we would uh, mix things up here. I actually brought in real popcorn-"}, {"type": "line", "person": "Gregg", "line": "Oh wow! Okay!"}, {"type": "line", "person": "Tim", "line": "Movie theater style popcorn, I thought we could spice things up because uh... these movies are popcorn movies. Um..."}, {"type": "line", "person": "Gregg", "line": "And if you're at home, watching uh, On Cinema, go ahead and pop some popcorn up."}, {"type": "line", "person": "Tim", "line": "<dissatisfied noise>"}, {"type": "line", "person": "Gregg", "line": "It's a little stale."}, {"type": "line", "person": "Tim", "line": "Today's movie is Guy Har- Die Hard, or A Hood Day to Die Hard. They keep coming up with different ways of saying Die Hard. Dark directed by John Moore. Uh, and it stars Bruce Willis, Jai McCartney- Jaie Courtney. <dissatisfied noise> And some Mary Elizabeth Winstead. Two women, I guess."}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "Never heard of any of them except for Bruce. The best."}, {"type": "line", "person": "Greg", "line": "Well, that's the one that really counts-"}, {"type": "line", "person": "Tim", "line": "Yeah-"}, {"type": "line", "person": "Gregg", "line": "With a Die Hard movie."}, {"type": "line", "person": "Tim", "line": "Um, Bruce is- uh, plays John McClaine, travels to Russia to help his son, Jack, prevent a nuclear weapons heist, led by underworld forces. And Jack is uh, the character's name, Jack Mc- Oh, John McClaine. His son's named Jack. Which is another- Jack is short for John. So he could be Jack Junior-"}, {"type": "line", "person": "Gregg", "line": "Or like John F. Kennedy, they would- his nickname was Jack."}, {"type": "line", "person": "Tim", "line": "Anyhow, I love- I've always loved the Die Hard movie series, and I remember when I first saw the original one, 'cause Jack Nichols- or, uh, Bruce Willis was oh on- on shows called Loom- Moonlighting. But, here he is."}, {"type": "line", "person": "Gregg", "line": "And still-"}, {"type": "line", "person": "Tim", "line": "And it was a big success when it came out, and it continues to be-"}, {"type": "line", "person": "Gregg", "line": "And still good. You'd think, oh, Bruce Willis is getting a little old, maybe it's time to pass the torch to a new generation of Die Hard characters, but then you see this movie and you realize, nope, let's keep him in the throne. This is a good series-"}, {"type": "line", "person": "Tim", "line": "And that's why I hate bond, because Bond kept changing who Bond was. And th- Bruce Willis has always been Die Hard, and always will be-"}, {"type": "line", "person": "Gregg", "line": "But it-"}, {"type": "line", "person": "Tim", "line": "And if they try to change that, I'll drop out of the whole thing, and I won't watch any more Die Hards-"}, {"type": "line", "person": "Gregg", "line": "Well, I'm gonna have to disagree. With Bond, they're always improving on it. Each Bond is better than the previous Bond, and th-"}, {"type": "line", "person": "Tim", "line": "No."}, {"type": "line", "person": "Gregg", "line": "Those've been going on for sixty years. You can't have somebody who's ninety years old, who's James Bond. It's just not convincing."}, {"type": "line", "person": "Tim", "line": "Well, I- I don't buy it. It doesn't make sense to me how you could have a same character with different looks, with the same name. Thi- this is why I loved Die Hard. Because they don't give up on <spits popcorn> I shouldn't of eaten this shit <spits, coughs, picks teeth> I got this <picks teeth> kernel <picks teeth, coughs> Went right- <coughs> right in the back. Oh! Glass. <coughs deeply, repeatedly> Okay. <coughs> Uh, Good- yes, so. Die Hard does it right every time. Bruce Willis in the lead, and I give it s- uh, five bags of popcorn, and um, my own private collection of popcorn as well, five bags from my own private collection, of my own popcorn."}, {"type": "line", "person": "Gregg", "line": "Um... I'd give it five bags of popcorn, how can you not give a Die Hard movie five bags of popcorn? They're all kind of five-baggers. I would also throw in uh, a goblet of the finest champagne, and toast Bruce Willis and the whole Die Hard gang for bringing us yet another successful hit."}, {"type": "line", "person": "Tim", "line": "Alright, our second film is Escape From Planet Earth. Not to be mistaken from Undist- uh, Escape from Planet- or from Planet Earth- Escape from New York-"}, {"type": "line", "person": "Gregg", "line": "Escape- Planet of the Apes. Escape from-"}, {"type": "line", "person": "Tim", "line": "No, Escape from New York."}, {"type": "line", "person": "Greg", "line": "Okay."}, {"type": "line", "person": "Tim", "line": "With uh, John Cleese. Um- or no uh, John S- uh, Singleton. Or John uh-"}, {"type": "line", "person": "Gregg", "line": "Kurt Russell."}, {"type": "line", "person": "Tim", "line": "Right, K- I'm sorry, Kurt Russell. This stars Brendan Fraser, it's a animated film. Um, Brendan Fraser, Sarah Jessica Parker, and James G- Ra- um, James K- Kla- James, uh, Gaphi- Gaphini... Gandalf."}, {"type": "line", "person": "Gregg", "line": "From The Hobbit."}, {"type": "line", "person": "Tim", "line": "James Gandolf- uh, eeney. K- J- James Gandolophini- Ph- Gail- Gandalphi... I don't know how to pronounce the name... Gandolphi- Gandolphi- uh, ini. James Gandolphini..."}, {"type": "line", "person": "Gregg", "line": "Gandaphini."}, {"type": "line", "person": "Tim", "line": "For uh- so this is an astronauts named Scorch Supernova. Love that name. Finds himself in a trap where he- he uh, bas- basically have to escape from planet Earth."}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "Um, this movie thrilled and chilled me, and uh, I love this movie, it was fun, sci-fi's my favorite kind of movie, but it also comedy and animated films are my favorite kinda movies. So this has all three wonderful combinations to make my film of the- one of my films of the year. Escape from Planet Earth."}, {"type": "line", "person": "Gregg", "line": "It's a great movie. I don't think you're gonna find anyone that would uh, disagree. I would say it could've been made just a little bit better if- you've got somebody like Brendan Fraser, who's a great resource- If you'd actually filmed him rather than animate him, I think it would've been more enjoyable. People like Brendan Fraser and it's kinda weird to look at a cartoon when you could be looking at the real thing. So that's a mistake I think they made-"}, {"type": "line", "person": "Tim", "line": "No, there's no mistake. That- not a mistake. That was a choice. It was the right choice-"}, {"type": "line", "person": "Gregg", "line": "But I think it was- it was the wrong choice because uh, Brendan Fraser, he's not Mel Blanc, he's not some fatso that you don't wanna look at. This is a guy who's b- had a great career-"}, {"type": "line", "person": "Tim", "line": "No."}, {"type": "line", "person": "Gregg", "line": "He's very photogenic, very handsome-"}, {"type": "line", "person": "Tim", "line": "No. Ni- You know what? I'm not <slaps Gregg's popcorn out of his hand> I'm not letting you say that kinda crap on my show. Okay? This was the made- the way they made the movie. They did- They animated it, it wouldn't work as a uh, uh, <slaps own popcorn away as Gregg reaches for it> it wouldn't work as that either. Alright? Now don't..."}, {"type": "stage_direction", "stage_direction": "lights out"}], "name": "S02E02"}