{"transcript": [{"type": "line", "person": "Tim", "line": "Three bags of popcorn, four bags of popcorn, five bags of popcorn, five bags of popcorn two sodas. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi, my name is Tim Heidecker and I'm the host of this show you're watching called On Cinema at the Cinema. It's a webseries dedicated to fa- our- to movies and reviewing movies and what's coming out this week and whether or not you should go see them or whether or not you just stay away and stay home and do something else or watch the football game. Uh, my guest is acclaimed filmmake- or acclaimed uh, film buff, Gregg Turkington. Welcome back to the show, Gregg!"}, {"type": "line", "person": "Gregg", "line": "Hey guys, good to be here and uh, good to see ya, Tim."}, {"type": "line", "person": "Tim", "line": "Good to see you. Thank you for your great report last week on Jimmy McNichol, it was very interestin-"}, {"type": "line", "person": "Gregg", "line": "Well, it was a lot of fun, getting to know Jimmy-"}, {"type": "line", "person": "Tim", "line": "Yeah."}, {"type": "line", "person": "Gregg", "line": "And uh, talking to him about some of his work."}, {"type": "line", "person": "Tim", "line": "Yeah, I didn't- uh, honestly didn't know who he was. Um, so it was neat to learn about a new guy. Uhh-"}, {"type": "line", "person": "Gregg", "line": "Well he's not a new guy, he's been around for years, but he's- he's one of the best, and very gracious, a gentleman, and it was very fun to talk to him."}, {"type": "line", "person": "Tim", "line": "...The company keep, directed by Steven Soderbergh is our film, uh, today, with Robert Redford. And uh, Shia LaBeouf, and Nick Nolte! Wow. Well, this is a- um, 'nother Steven Soderbergh movie that we talked about earlier in the- in the year, we talked about uh, him, and uh, this is another thriller. And it's another movie by Steven Soderbergh. So, it, uh, gets a uh, high marks from me-"}, {"type": "line", "person": "Gregg", "line": "It's uh, one of those movies where you're enjoying it, but the whole time you're thinking, could I be learning something here too, and uh, that's kind of a nice combination, I think it's a special film and I think it's the type of film, uh, people will be talking about-"}, {"type": "line", "person": "Tim", "line": "I had the feel- feeling of I'm enjoying this movie, but when is it gonna end. 'Cause I- not because I was bored, but I just wanted to find out what's gonna happen."}, {"type": "line", "person": "Gregg", "line": "That's a mark of a good film."}, {"type": "line", "person": "Tim", "line": "Mhm. So, with that said, I give it four bags of popcorn, and uh, one glass of uh, soda."}, {"type": "line", "person": "Gregg", "line": "I'm gonna give it uh, five bags of popcorn. I really liked it, and uh, maybe put them on uh, the back of a runaway freight train, 'cause the film's pretty exciting."}, {"type": "line", "person": "Tim", "line": "Well, I wonder if uh, the ol- if Robert Redford himself, uh, ever would've put this in his famous Sundance Film Festival? Um-"}, {"type": "line", "person": "Gregg", "line": "I'm sure it was there."}, {"type": "line", "person": "Tim", "line": "Uh, and now I'm regretting, um, not making this about St- about Robert Redford, but I w- I am gonna be doing a tribute to S- Steven Spielberg later. Because I'm- and the reason I'm... um, not just coming out of the b- bla- coming out with that without thinking about it, the reason is, Jurassic Park In... Here we go, ready? In 3D."}, {"type": "line", "person": "Gregg", "line": "Yayyy! It's about time."}, {"type": "line", "person": "Tim", "line": "Well, are we doing it in 3D? Why not?"}, {"type": "line", "person": "Gregg", "line": "What, this?"}, {"type": "line", "person": "Tim", "line": "Yeah, I- he's... Forget that."}, {"type": "line", "person": "Gregg", "line": "It's um, it's fun to give a movie like this sort of a new life, a movie that um-"}, {"type": "line", "person": "Tim", "line": "[...] I thought we were gonna be able to do this in 3D... Okay. Jurassic Park wreathed in 3D. I thought we were gonna be able to cut to this part of the segment in 3D..."}, {"type": "line", "person": "Gregg", "line": "That would be cool. That would be pretty cool."}, {"type": "line", "person": "Tim", "line": "Yeah, that was my idea, and uh, somebody said that that would be possible."}, {"type": "line", "person": "Gregg", "line": "<extends his hand, opening and closing it>"}, {"type": "line", "person": "Tim", "line": "Don't do that. Do we have to swap cameras?... Sh- should we wait?"}, {"type": "line", "person": "Gregg", "line": "The Jurassic Park entry that-"}, {"type": "line", "person": "Tim", "line": "No, hold on a sec. You told me we were gonna be able to do this in 3D..."}, {"type": "line", "person": "Gregg", "line": "Sam Neill is great, and-"}, {"type": "line", "person": "Tim", "line": "I'm pissed."}, {"type": "line", "person": "Gregg", "line": "And um, Jeff Goldblum, and..."}, {"type": "line", "person": "Tim", "line": "We can take five if you want to set up for 3D... Um- so- compu- if- ge- I'm- my point is, can we get people to wear the glasses? What's the di- wh- m- m- alright. Well, f- okay, so this in regular 2D, which is fine. Uh, but the movie Jurassic Park is in 3D. I'm sorry, I'm pissed about this. You said we were gonna be able to put this- you said that because it- because of what? Because it's on web? Or what?... Alright. It's the whole point. I don't understand, it's the whole p- that's the whole r[...]-"}, {"type": "line", "person": "Gregg", "line": "It's good, you know, I love this movie the old way, and I'm glad they haven't tinkered with the movie themselves. Sometimes when they reissue things, they'll cut some of the scenes you liked. This is the same Jurassic Park that you know and love, but it's in 3D now-"}, {"type": "line", "person": "Tim", "line": "Yeah."}, {"type": "line", "person": "Gregg", "line": "And so, it actually comes out at you, and dinosaurs are-"}, {"type": "line", "person": "Tim", "line": "Jurassic Park's in 3D, not our segment..."}, {"type": "line", "person": "Gregg", "line": "It's really frightening when they ch-"}, {"type": "line", "person": "Tim", "line": "Don't- don't make promises you can't keep."}, {"type": "line", "person": "Gregg", "line": "When a dinosaur chomps on something, it's-"}, {"type": "line", "person": "Tim", "line": "We all know what happens in Jurassic park, it's a great movie, it's a classic movie, it's one of the greatest movies Steven Spielberg ever made. That's why... can't do this... 'kay..."}, {"type": "line", "person": "Gregg", "line": "It'd if they rereleased all the old On Cinemas in 3D, wouldn't it?"}, {"type": "line", "person": "Tim", "line": "I just want you to be straight with me... Alright... I apologize."}, {"type": "line", "person": "Gregg", "line": "It's okay. Um, but Jurassic Park in uh, 3D is uh-"}, {"type": "line", "person": "Tim", "line": "You know, what I always don't understand about these rereleases in 3D, is why didn't they just show the original movie in 3D? If they shot it in 3D, why wait 'til now to put it out?"}, {"type": "line", "person": "Gregg", "line": "Well, you don't wanna second-guess Steven Spielberg, because he's the master, so."}, {"type": "line", "person": "Tim", "line": "I agree with-"}, {"type": "line", "person": "Gregg", "line": "Maybe at that time, the glasses were more expensive? Who knows."}, {"type": "line", "person": "Tim", "line": "Alright. Well, I have a tribute to Steven Spielberg-"}, {"type": "line", "person": "Gregg", "line": "Oh, you know what I have for you, it's a tribute to you, actually, it's a, sort of a present that I picked up in uh, one of my journeys to the flea market. Um, this a pretty unique item. Uh, I would venture to say it's quite valuable. This isn't uh, Antique Roadshow here, but this is something you're not gonna find everywhere, uh, or anywhere. It's a Spanish language version of Jurassic Park! It's called uh, Parque Jurásico. When you put this in your video player, it starts out, you think you're watching Jurassic Park, and then it's wild. Every line of dialog is totally in Spanish, so um, I've never seen anything like this before, and uh, it's my gift to you to thank you for all you've contributed, uh, to On Cinema."}, {"type": "line", "person": "Tim", "line": "...Hm. Thank you very much."}, {"type": "line", "person": "Gregg", "line": "...Very unique."}, {"type": "line", "person": "Tim", "line": "...I can't read this. Looks like I'm just looking at random num- l- uh, l- random uh, letters-"}, {"type": "line", "person": "Gregg", "line": "That's the beauty of it, is it's uh, so familiar, yet so different, and that's- I think you'll have fun. This would be a fun thing to watch with friends late at night, have a couple of drinks, have a few laughs, and uh, enjoy El Parque Jurásico. St- Est- Esteban Stielberg... Totally in Spanish."}, {"type": "line", "person": "Tim", "line": "...Alright, thanks for watching."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "The whole fucking point of this was that I was gonna be able to do 3D, and it- tied that into 3D [...]"}], "name": "S02E09"}