{"transcript": [{"type": "line", "person": "Tim", "line": "I'm telling you if you see one movie this year, it's gotta be this one. Sorry guys, I can't give great review to every movie I see. This one's only getting three bags of popcorn. I don't know what movies to see this weekend. Well we're here to help. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker and I'm the host of On Cinema at the Cinema. It's my show where I talk about movies and review them and tell you which movies to see and which ones you should skip. Uh, it's a really great show and an honor to do it for you guys every week, and thank you for letting me do the show. Uh, th- and thanks to uh, the website, for putting it up. Uh, my guest today is Gregg Turkington."}, {"type": "line", "person": "Gregg", "line": "Hey guys, good to be here, and uh, congratulations Tim, on uh, so far, a great season!"}, {"type": "line", "person": "Tim", "line": "Yeah, it's been a lot of fun talking movies with you, and um- Uh, we only have one movie today we're gonna talk about. It's called The Croods. And that's not uh, C R U D E S, it's C R O O D S. Directed by another directing team here. We got uh, Kurt DeMicco and Chris Sanders. Uh, starring the voices of Nicolas Cage, Ryan Reynolds, and Emma Stone. Um, another wonderful uh, fun movie about the past, cavemen, and whatnot. This is the world's first family must embark on a journey through new lands after the cave, which has always sheltered them, is destroyed. So obviously it starts from a place of sadness, but it's a lot of fun and uh, um, it's beautifully drawn and it has an- uh, t- tremendous energy to it. Uh, one of my favorite movies of the year. Gregg?"}, {"type": "line", "person": "Gregg", "line": "Yeah, I gotta say, uh, thinking about this movie just makes me feel warm all over. It was a lot of fun. I, uh, went with a couple family members-"}, {"type": "line", "person": "Tim", "line": "Mhm."}, {"type": "line", "person": "Gregg", "line": "And they had fun and uh, they're not professional critics or experts, but they know what they liked and they like this movie and I like it too-"}, {"type": "line", "person": "Tim", "line": "I love that. I love, uh, sort of um, comin' off the high horse, you know, a little bit, and saying Oh, well guess what? People of all ages and not just- you don't have to be some hooty-tooty film critic or something like that. This is really for the people, by the people, uh, and a great American film. Nicolas Cage's voice is so distinctive-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "I forgot that h- he was in this, and I went to go see it and I go who's the sound of that voice? Reminds me of Nicolas Cage. Lo and behold, it was. And his voice is-"}, {"type": "line", "person": "Gregg", "line": "Well..."}, {"type": "line", "person": "Tim", "line": "So that- i- that's how distinctive it is."}, {"type": "line", "person": "Gregg", "line": "He's an academy award winner, so, uh, he's not gonna muck around. He's gonna give you a good performance, whatever it is, and uh, in this case, uh, we're lucky to have him, 'cause this movie really sorta blew my mind. It was- it was great-"}, {"type": "line", "person": "Tim", "line": "And it's funny 'cause this has always been a fantasy of mine is what was it like back in the cavemen days? You know, not just what we see from Flintstones, but actually what was it like? And this kinda bridges the gap where it's not just com- it's not like a documentary of course, but it's not as silly and ridiculous as The Flintstones. Uh, it's more grounded but still with a lotta heart. Great- greatly drawn. I give it s- five bags of popcorn."}, {"type": "line", "person": "Gregg", "line": "Well, I guess this is more like The Flintstones, but if you were to sorta haul out uh, stones and make popcorn containers out of that, that's what they would have done on The Flintstones, so I would give it five of those."}, {"type": "line", "person": "Tim", "line": "<burps> Alright. <sips drink> Sorry, I have not slept. <sips drink>"}, {"type": "line", "person": "Gregg", "line": "... So five tubs of popcorn."}, {"type": "line", "person": "Tim", "line": "Alright, well now, I'm very excited, this is a very special episode and I shoulda said that at the beginning, that this is a very special episode. Uh, we're going to be doing a uh, Stump the Buff. So we get the graphics for Stump the Buff."}, {"type": "stage_direction", "stage_direction": "Stump the Buff Intro"}, {"type": "line", "person": "Tim", "line": "This is uh, where we ask our esteemed film expert a series of trivia questions about the movies, and this is kinda neat, we have worked out with the Thing X dot com that they are going to be donating five hundred dollars for every question that Gregg gets right to the American Cancer Society-"}, {"type": "line", "person": "Gregg", "line": "This is gonna be fun and um-"}, {"type": "line", "person": "Tim", "line": "Yeah <chuckles nervously>"}, {"type": "line", "person": "Gregg", "line": "I know we're gonna go into uh, uh, four digits at least, so."}, {"type": "line", "person": "Tim", "line": "<chuckles good-naturedly> Alright, well let's uh, let's get- start with the first question here. Who was the cinema- I feel like I'm Alex Trebek or something. This is very- very cool for me too. Um... <a mutual happy smile passes between Tim and Gregg> Alright, now. First question is behind the lens. Who was the cinematographer for Robert Altman's 'Popeye'?"}, {"type": "line", "person": "Gregg", "line": "... Uh, Robert Altman... uh, was the director... Um... ah... so tha- eh... that was Andrew Dunn. Cinematographer Andrew Dunn."}, {"type": "line", "person": "Tim", "line": "Nope, sorry. Was um, Giuseppe Rotunno. Rotunno. A French guy. Italian guy."}, {"type": "line", "person": "Gregg", "line": "I think it was Andrew Dunn. He did um, the uh, if you seen the Steve- well, we talked about the Steve Martin movie A Simple Twist of Fate, which was a movie that we covered on this show. Uh, a couple weeks ago-"}, {"type": "line", "person": "Tim", "line": "Alright, well speaking of Steve Martin, this is our second question, so with uh, one wrong so far. Zero money raised. Ready for your second question-"}, {"type": "line", "person": "Gregg", "line": "Yep."}, {"type": "line", "person": "Tim", "line": "How many movies- you'll like this one 'cause y- I know you're a big fan of this guy. How many- how many movies did Steve Martin make in the eighties? That's a good question. How many movies did Steve Martin make-"}, {"type": "line", "person": "Gregg", "line": "Hmm. Okay. This is easy. Um... <mutters under breath, counting>"}, {"type": "line", "person": "Tim", "line": "How many movies did Steve Martin make in the nineteen eighties?"}, {"type": "line", "person": "Gregg", "line": "...Thirteen. Thirteen movies."}, {"type": "line", "person": "Tim", "line": "Aw, man. Close. Lucky- unlucky thirteen, 'cause the answer is fourteen. Alright, 'o for two."}, {"type": "line", "person": "Gregg", "line": "No, uh, it's thirteen, um... are you counting the- the decade-"}, {"type": "line", "person": "Tim", "line": "No, I'm didn't make these qu- I didn't write these questions we got here. These are the official-"}, {"type": "line", "person": "Gregg", "line": "But are you c- if the decade- I'm counting the decade the way a decade goes, which is from nineteen eighty one to... nineteen ninety. That's ten years. That's what I was counting, and that's where I got my number, so I- I think I'm righ-"}, {"type": "line", "person": "Tim", "line": "Alright, well I'm going by fourteen. Yeah, the number's fourteen, so-"}, {"type": "line", "person": "Gregg", "line": "But that's not really the eighties. The eighties actually go from nineteen eight-"}, {"type": "line", "person": "Tim", "line": "I don't think it would make a difference. I think it would still be yourn answer would be wrong, not matter what. Alright sec- third question. We've raised zero- raised no money yet. Uh-"}, {"type": "line", "person": "Gregg", "line": "Well, we could've raised money if you worded the questions properly-"}, {"type": "line", "person": "Tim", "line": "Alright. Third question. How do you spell- this is one of your favorite actre- actors. You should know the answer to this one."}, {"type": "line", "person": "Gregg", "line": "Okay."}, {"type": "line", "person": "Tim", "line": "How do you spell Richard Dreyfuss?"}, {"type": "line", "person": "Gregg", "line": "You're not gonna throw it out on a technicality if I don't spell Richard too, like you threw out the last one on a technicality?"}, {"type": "line", "person": "Tim", "line": "Just- yeah, I think you have to spell the whole name-"}, {"type": "line", "person": "Gregg", "line": "Just to make sure, it's R I C H A R D... and then it's uh, D R Y F U S... S S S? I think it's one S? F U S S. F U S. Dreyfuss. F U S. Geez. F U S. Yeah, there's two S's. It's D R Y F U S S."}, {"type": "line", "person": "Tim", "line": "Mkay. It's D R E Y F U S S, so."}, {"type": "line", "person": "Gregg", "line": "F U S S, that's what I said, so-"}, {"type": "line", "person": "Tim", "line": "I know, but E Y. D R E Y F U-"}, {"type": "line", "person": "Gregg", "line": "D R E- Ohhhhh. D- oh, yeah..."}, {"type": "line", "person": "Tim", "line": "Thought you'd get that one. Alright, well that's 'o for three. <sighs> Focus in. You're my buff. Let's just focus and get one of these right. Two of these right, be great. Uh, this one is an easy one. You'll get this one, raise some money for the American Cancer Society-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "Ready? Who won best supporting actor for his role in City Slickers?"}, {"type": "line", "person": "Gregg", "line": "Billy Crystal! Er-"}, {"type": "line", "person": "Tim", "line": "No."}, {"type": "line", "person": "Gregg", "line": "Auggh. Supporting actor."}, {"type": "line", "person": "Tim", "line": "Alright. Jack Palance is the correct answer..."}, {"type": "line", "person": "Gregg", "line": "Yeah, I thought you said best actor..."}, {"type": "line", "person": "Tim", "line": "Okay-"}, {"type": "line", "person": "Gregg", "line": "There's the best actor Oscer-"}, {"type": "line", "person": "Tim", "line": "No."}, {"type": "line", "person": "Gregg", "line": "Which is-"}, {"type": "line", "person": "Tim", "line": "Billy Crystal didn't win best actor anyway, so. He starred in the movie. <sighs deeply> Alright. Um, well... Four- number five. This is the final question. Let's see if we can raise five hundred dollars for the American S- uh, Cancer Society, which I think they'd appreciate... Alright. How many Oscers did the film Titanic win?"}, {"type": "line", "person": "Gregg", "line": "...Seven."}, {"type": "line", "person": "Tim", "line": "Eleven. <sighs deeply> Thanks for watching. Cut the dang-"}, {"type": "stage_direction", "stage_direction": "lights out"}], "name": "S02E07"}