{"transcript": [{"type": "line", "person": "Tim", "line": "These are great movies! When you got movies like Tom Cruise in them, you can't lose! Six bags of popcorn, two sodas. It's On Cinema at the Cinema with me, your host, Tim Heidecker."}, {"type": "line", "person": "Tim", "line": "Hi everybody, my name is Tim Heidecker; you're watching another episode of On Cinema at the Cinema, the webseries, um, where we discuss different movies and what movies are coming out this weekend, and also cinema in general, and hopefully give you guys a good idea what's out there and what's uh- and what you might wanna skip. Um, my guest is um, G- uh, Gregg Turkington."}, {"type": "line", "person": "Gregg", "line": "Hey Guys! Good to be here uh, on On Cinema uh, yet again."}, {"type": "line", "person": "Tim", "line": "Um, thanks for being on the show. Um-"}, {"type": "line", "person": "Gregg", "line": "Of course. I loved being on the show and I'd love"}, {"type": "line", "person": "Tim", "line": "...S- Same thing. Just let me get through my card-"}, {"type": "line", "person": "Gregg", "line": "Yep! Yep."}, {"type": "line", "person": "Tim", "line": "You've seen these shows before... You've seen how this works. Our first movie today is Snitch. Doctor- Directed by Ric Roman V- Waugh- ha- or it's W H U G- W A-"}, {"type": "line", "person": "Gregg", "line": "Vaughn. I think it's pronounced Vaughn."}, {"type": "line", "person": "Tim", "line": "W-"}, {"type": "line", "person": "Gregg", "line": "Did it-"}, {"type": "line", "person": "Tim", "line": "A U G H-"}, {"type": "line", "person": "Gregg", "line": "Oh, uh, sorry. I thought it was-"}, {"type": "line", "person": "Tim", "line": "Is-"}, {"type": "line", "person": "Gregg", "line": "V- V A U G H A N is Vaughn."}, {"type": "line", "person": "Tim", "line": "No, this is director Ric Roman Waha. And he's a no-name director, so. I can't mknow- I can't... know every director. Uh, this stars the great Dwayne Johnson, who I guess is not going by Rock anymore. Uh, Jera- and Susan Sarandon, and Vince uh, Velasquez. Noernetin- Oh, sorry. Nadine Velasquez. A Mexican name. Um, and this movie is about an undercover father for the DNA in order to free his drugs- or, son, who's in prison after being set up by a drug deal. Um, yes. This was a very, very great film. Um, I liked this movie a lot. I thi- I sho- it- boy did it- it really did show a different side of The Rock."}, {"type": "line", "person": "Gregg", "line": "Yeah, and of the drug underworld, too, which is a interesting world. I think if I was gonna go to the movies in- on- e- some afternoon, I think I'd go see The Hobbit, which is still playing in a few theaters. It's not a first-run movie, but if you haven't seen it, you really should see it. It's a classic."}, {"type": "line", "person": "Tim", "line": "But some of these cheaper theaters are not gonna obviously have the 3D abilities to show The Hobbit, so if you still recommend seeing Hobbit-"}, {"type": "line", "person": "Gregg", "line": "Well, I mean you had that for months. It's gonna be better than it's gonna be watching it on your computer or at home, so it's kinda your last chance to see The Hobbit as it was meant to be seen."}, {"type": "line", "person": "Tim", "line": "Alright. Well, so I give uh, Snitch five, uh, ba- or four bags of popcorn. Um, and uh, and uh, uh, two cans of s- two bottles of soda."}, {"type": "line", "person": "Gregg", "line": "I'm gonna give Snitch four bags of popcorn, but throw in one other bag for being so realistic and gritty-"}, {"type": "line", "person": "Tim", "line": "Mhm."}, {"type": "line", "person": "Gregg", "line": "For a total of five bags."}, {"type": "line", "person": "Tim", "line": "And our second film for today is Dark Skies with Keri Russell, Dakota Goyo, and Josh Hamilton. Uh... and uh, directed by another three-name director. I guess that's a new trend in cinema here. Director Scott Charles Stewart. Those are also three man's full- first names, so it could be just uh, three men- could be three men directing it, and they just didn't give their last n-"}, {"type": "line", "person": "Gregg", "line": "No, it's one guy. Thi- because sometimes there's people with the same name, uh, they put a middle name in. Th- There's been so many movies, so many directors, that-"}, {"type": "line", "person": "Tim", "line": "All I'm saying is this could've been a three person- like sometimes you have the Cohen Brothers and people like this-"}, {"type": "line", "person": "Gregg", "line": "Mmm."}, {"type": "line", "person": "Tim", "line": "This could be Scott, Charles, and Stewart. Three men directing one m-"}, {"type": "line", "person": "Gregg", "line": "Well, it's probably there was already a Scott Stewart, so he had to make himself different than that guy, and that's where you get the middle name."}, {"type": "line", "person": "Tim", "line": "Alright. Well, I headed an emergency uh, and was not able to finish seeing th- Dark Skies, so I give it a uh, three bags, with the-"}, {"type": "line", "person": "Gregg", "line": "Should give it-"}, {"type": "line", "person": "Tim", "line": "Conditional that um, I'm assuming that it deserves four or five, and when I do see that, we'll update that on the website."}, {"type": "line", "person": "Gregg", "line": "You could give it uh, five half-full bags."}, {"type": "line", "person": "Tim", "line": "Mhm."}, {"type": "line", "person": "Gregg", "line": "Because is- if you saw the whole thing, as I did, you would give it five bags. Uh, five half-full bags, it's- it sort of shows that it's incomplete-"}, {"type": "line", "person": "Tim", "line": "Mhm."}, {"type": "line", "person": "Gregg", "line": "And that's what you want the viewers to understand."}, {"type": "line", "person": "Tim", "line": "Alright, well uh, let's uh, move on to our next segment, which is a new, very new segment. A brand new segment called, um, uh, On Cinem- On Cinema Presents: Popcorn Classics: BTC. And uh, what does the BTC stand for?"}, {"type": "line", "person": "Gregg", "line": "Behind The Curtain!"}, {"type": "line", "person": "Tim", "line": "Behind The Curtain-"}, {"type": "line", "person": "Gregg", "line": "And in this new segment of mine, we're looking, sort of pulling the curtain open, and seeing what, uh, is really back there in Hollywood, meeting some of those-"}, {"type": "line", "person": "Tim", "line": "Well, it's essentially an interview segment where you interview famous person, we've ebid- the honor of you getting to talk to talk to s- this famous person. And that person is Joe Estevez."}, {"type": "line", "person": "Gregg", "line": "Joe Estevez, who I met at a recent film premier-"}, {"type": "line", "person": "Tim", "line": "And Joe Estevez is the brother of Charlie- Martin Sheen, and uh, you might know him from uh, movies The Turning Point, Rugaru, Out of the Darkness, uh, Gunfight in Yuma, Autism and Cake, uh, The Voices From Beyond, Doonby, Gold Cage, Little Creeps-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "Inside Out, Plastic Films, The Haunting uh, of Pearson Place, uh, Interpersonal Exopolitics, Under the Bridge-"}, {"type": "line", "person": "Gregg", "line": "Yeah, and-"}, {"type": "line", "person": "Tim", "line": "Omerta, Onion Soup, Sebastian, Doctor Spine, In- I- Insignficant Celluloid, uh, Horrorween, Kingsmen, First Dog, Mitchel Tapes, Daddy's Home-"}, {"type": "line", "person": "Gregg", "line": "Daddy's Home, yeah."}, {"type": "line", "person": "Tim", "line": "Iron Soldier, Dark Crossing, Days of Light, Primates, The Magic, uh, Dragon, The Apparition of Roxanne, uh, The Vigilante, Vanguard, A Perfect Life, The Ascent-"}, {"type": "line", "person": "Gregg", "line": "Mhm."}, {"type": "line", "person": "Tim", "line": "Placebo, Corruption Governor, Not Another B Movie, The Light, Meltdown, Flesh, TX, uh, The Death of Hollywood, The Lives of Better Men, Dead In Love, Serbian Scars, uh, Withered One, um, Hollywood Confidential, See Jane Run, Zombie Farm, Cake: A Wedding Story, Cordoba Nights, Death Row, Killa Zombies, Sigma Die!, Necronaut, Alibi, Koreatown, The Troll, Shut Up and Shoot, Voices From the Grave, Third Degree, Evil After Ever, Inner Rage, um, The I.R.A.: King of Nothing, Resurrection Mary, Scar, The Tailor, uh, Dead Things, 2020: An American Nightmare, Hercules in Hollywood, Drawing Blood, The Evil Chamber, Evil Grave: Curse of the Maya, Buy Sell Kill: A Flea Market Story, The Rockville Slayer, Death, Can I Buy You a Drink?, uh, Vampire Story, Vampire- or Killer Story, Vampire Vow- uh Blvd., Summer Solstice, Rice Girl, An Inferno, Mind of Terror, Zombiegeddon, uh, Hitman City, Got Papers?, uh, Scary Tales: The Return of Mr. Longfellow, Mind Games, Spanish Fly, Russians in the City of Angels, Tales From the Grave, Las Vegas Psycho, uh, Vatos, Jumping for Joy, Max Hell, uh, Frog Warrior, Mob Days, uh, Deathbed, Autopsy: A Love Story, Hell Asylum, Psychotic, No Dogs Allowed, Jumper, Pacino Is Missing, Two Coyotes, Shattered Faith, No Turning Back, Double Deception, uh, Black Scorpion, The Remnant, Green Diggity Dog, Ultimate Prey, Stolen from the Heart, Flat Out, 14 Ways to Wear Lipstick, uh, Silent Scream, No Code of Conduct, um Crimes of the Chupacabra, Fatal Pursuit, I Got the Hook Up, uh, Guns of El Chupacabra II: The Unseen, Together & Alone, Avenged, The Catcher, Memorial Day, No Rest for the Wicked, uh, Lola's Game, Tex Murphy: Overseer, The Waterfront, Winner Takes All, uh, Acts of Betrayal, Motorcycle Cheerleading Mommas, Lethal Seduction, Dark Secrets, Guns of El Chupacabra, Gator King, Breakaway, The Searcher, The Last Kill, The Garbage Man, Rollergator, Blood Slaves of the Vampire Wolf, uh, Squanderers, Demolition Highway, Lethal Orbit, uh, Carnival of Wolves, American Tigers, Last of the Breed, Werewolf, Toad Warrior, Backroads to Vegas, Red Line, Dillinger and Capone, uh, Little Lost Sea- uh, Sea Serpent, uh, Cruise, uh, Starstruck, Baby Ghost, uh, Equal Impact, Karate Raider, With Criminal Intent, Blvd., Guns and Lipstick, Quiet Days in Hollywood, um, you know, Point Dume, Broken Bars, uh, Blood Heaven, Inner Sanctum II, The Mosaic Project, Double Blast, Fatal Justice, Body Count, um, The Deadly Secret, Unconditional Love, Dark Universe, Beach Babes from Beyond, uh, L.A. Goddess, In a Moment of Passion, Cyber Seeker, Karate Commando, um, uh, Madame, The Flesh Merchant, Eye of the Stranger, uh yeah, Expert Weapon, Armed for Action, Eddie Presley, The Summoned, Lost in Hollywood, Psychic Detectives, Return of the Roller Blade Seven, Legend of the Roller Blade Seven, uh, Blood on the Badge, The Roller Blade Seven, Dark Rider, Soultaker, Lockdown, Murder in Law, The Platinum Triangle, Fatal Pulse, South of Reno, Retreads, Human Error, uh, I married a Centerfold, The Invisible Woman, Anatomy of a Seduction, uh, Lucky- and Lucky Lady. Um, so uh, let's take a look at that interview now."}, {"type": "stage_direction", "stage_direction": "Popcorn Classics: Behind the Curtain Intro"}, {"type": "line", "person": "Gregg", "line": "Thanks, Tim, for welcoming us to this new segment! We're here with Joe Estevez! Good to see you, Joe."}, {"type": "line", "person": "Joe", "line": "Thank you."}, {"type": "line", "person": "Gregg", "line": "What actors do you think should get the academy award?"}, {"type": "line", "person": "Joe", "line": "Uh, the- the actors for um, coming out?"}, {"type": "line", "person": "Gregg", "line": "Just in general."}, {"type": "line", "person": "Joe", "line": "Uh, Humphrey Bogart, there's so many that are just... just-"}, {"type": "line", "person": "Gregg", "line": "And actresses too."}, {"type": "line", "person": "Joe", "line": "Yeah, I uh, huh, yeah."}, {"type": "line", "person": "Gregg", "line": "Of all the movies you've made, what are your ten favorites?"}, {"type": "line", "person": "Joe", "line": "South of Reno is a good movie. Jumping For Joy, terrible title. High on the Hog. Does that count if I can't think of the title?"}, {"type": "line", "person": "Gregg", "line": "Yeah, that's fine."}, {"type": "line", "person": "Joe", "line": "Okay. Alright. Oh, Bunyan! Bunyan! It's terrific!"}, {"type": "line", "person": "Gregg", "line": "Does it star Doctor Scholl?"}, {"type": "line", "person": "Joe", "line": "Uh, no, it stars Joe Estevez."}, {"type": "line", "person": "Gregg", "line": "When one of your films comes out on video tape, do they mail you a box of them?"}, {"type": "line", "person": "Joe", "line": "I have a lot of uh, unopened DVDs and even DVDs."}, {"type": "line", "person": "Gregg", "line": "They're more collectible if you leave them sealed."}, {"type": "line", "person": "Joe", "line": "Well, there you go! I- I got some maybe you might be interested in, then."}, {"type": "line", "person": "Gregg", "line": "I Definitely would. When you go to the movies, do you like to have your popcorn with butter or just plain?"}, {"type": "line", "person": "Joe", "line": "Plain, but with a lot of salt, and I get the big tub, eh, because you can go back and y- y- you can get that filled up again for free, most of the places a second time around, so..."}, {"type": "line", "person": "Gregg", "line": "Back to you, Tim, in the studio."}, {"type": "line", "person": "Tim", "line": "Alright! Very interesting. Seemed like a nice guy."}, {"type": "line", "person": "Gregg", "line": "Yeah, he was a really nice, and um, it was a lot of fun getting to meet him-"}, {"type": "line", "person": "Tim", "line": "Mhm."}, {"type": "line", "person": "Gregg", "line": "Getting to know him."}, {"type": "line", "person": "Tim", "line": "And uh, any s- secrets that you could- that uh, you couldn't reveal during the interview, any kind of um, anything that- that you were surprised by, or?"}, {"type": "line", "person": "Gregg", "line": "Well, um, we had sort of a conversation off the camera about uh, soup and salad and things like that. He l- he- he loves soup and salad bars, and um, as do I, so, that was kind of a nice little thing uh, getting to know each other."}, {"type": "line", "person": "Tim", "line": "Any- any particular, uh... where d- particular uh, secrets, or anything like that?"}, {"type": "line", "person": "Gregg", "line": "He likes the soup plantation, which is uh, sort of a chain. Uh, it's a regional chain, but it's very good soup, uh, if you like cream of potato or cream of broccoli, and uh, they do a good minestrone. Uh, and a big salad bar, too."}, {"type": "line", "person": "Tim", "line": "Alright. The Soup Plantation. <exhales deeply> Thanks for watching."}, {"type": "stage_direction", "stage_direction": "lights out"}, {"type": "line", "person": "Tim", "line": "[...]"}, {"type": "line", "person": "Gregg", "line": "Seen- I've seen a different of the Chupacabras."}], "name": "S02E03"}